[
  {
    "jobTitle": "Staff Data Engineer - Flight data and analytics team - For Women on Break",
    "jobDescription": "Job Details\nJob Description Contractual Period: 9 Months followed by FTE Position Collaborate with Data Scientists & Analytics Engineering team in finding & applying best practices for analytics development and deployment Design, develop & deploy the analytics on AWS platform (EMR, ECS) Analyze and understand data sources, participate in design, and provide insights and guidance on database technology and data modeling best practices Hands-on development using Big data analytics technologies such as Spark & Python Proficient with AWS services like EMR, ECS & S3 Utilize CI/CD Processes to automate development, deployment, and testing Write, analyze, and tune complex SQL queries Collaborate with business users, architects, and developers to build solutions that meet business needs Operate in Agile framework, creating user stories and tasks from customer requirements to track project progress Qualifications/ Requirements: Bachelor's Degree in Computer Science, Information Technology or equivalent (STEM) Minimum of 10 years of IT experience, 5 years of experience in Python Minimum 4 years of experience in AWS technologies. At least 1-2 years of experience in Py-Spark. Hands-on experience with AWS services - S3 / Glue / Glue Catalog/ Lambda /Step functions/ SNS / SQS / Dynamo DB / RedShift / EMR / Event Bridge / CICD Proficient in writing performant SQL queries for Oracle, MySQL, PostgreSQL, or Hive Exposure with Big Data / Hadoop / Hive. Ability to understand logical and physical data models, big data storage architecture, data modeling methodologies Exposure to Agile framework with an ability to collaboration between self-organizing cross-functional teams and focus on essential priority work.\nExperience\n5-8yrs\nSkills\nData Science & Analytics- Spark & Python- AWS platform (EMR- ECS)\nApply Now\n\n,Other Details DepartmentGeneral / Other SoftwareIT Operations / EDP / MISIndustry IT NGO / Social Work EducationGraduation",
    "": ""
  },
  {
    "jobTitle": "Azure Data Engineer",
    "jobDescription": "Job Details\nWe are looking for a Immediate candidates with 4 Years to 15+ years of experience in a Sr Data Engineer role and Lead Data Engineer Role, who has attained a Graduate degree in Computer Science, Statistics, Informatics, Information Systems or another quantitative field. They should also have experience using the following software/tools:\n\nExperience with big data tools: Hadoop, Spark, Kafka, etc.\nExperience with Azure cloud services: Databricks, Azure Data Factory, Azure SQL/ Synapse, ETL data warehousing\nExperience with relational SQL and NoSQL databases, including Postgres and Cassandra.\nExperience with data pipeline and workflow management tools\nExperience with JIRA, Agile, ETL Testing etc\nExperience with stream-processing systems: Storm, Spark-Streaming, etc.\nExperience with object-oriented/object function scripting languages: Python/Java, SQL, ETL etc\nExperience in the manufacturing industry is preferred.\n\n\nOther Details DepartmentDBA / DatawarehousingIndustry IT IT - Software",
    "": ""
  },
  {
    "jobTitle": "Candidates required for-MLOps Data Engineer",
    "jobDescription": "Job Details\nMLOps Data Engineer\nBe a part of a team that s ensuring Dell Technologies' product integrity and customer satisfaction. Our MLOps team turns business requirements into technology solutions by designing, coding, and testing/debugging applications, as well as documenting procedures for use and constantly seeking quality improvements.\nJoin us as a Data Engineer on our ML Ops team in India to do the best work of your career and make a profound social impact.\n What you ll achieve As an MLOps Data Engineer, you will deliver products and improvements for a changing world. Working at the cutting edge, you will craft and develop software for platforms, peripherals, applications, and diagnostics all with the most sophisticated technologies, tools, software engineering methodologies, and partnerships.\n What you'll do:\n\n\nFeature engineering: Stitching together and aggregating multiple large data sets working with the data scientist to the desired format. You will need to optimize both queries and architecture to support big data sets.\n\n\nData pipelining: Once the initial dataset is prepared, it is normally run through a further pipeline to prepare it for modeling. Here you will create features that make Machine Learning/Artificial algorithms work (e.g. translating the text into category variables). Expect to work with datasets with billions of rows and thousands of columns. Python/R is usually the preferred language, some larger tasks require Spark.\n\n\nTake the first step towards your dream career. Every Dell Technologies team member brings something unique to the table. Here s what we are looking for with this role:\nEssential Requirements\n\n\nThe primary skillset of building and maintaining complex ETL orchestrating pipelines preferably using Airflow\n\n\nData Engineering skillset with experience in Airflow, Python, Bash, SQL\n\n\nEducation (Bachelor s degree or higher) in Computer Science, Mathematics, or a related technical field, or equivalent practical experience\n\n\nYou have professional experience. Solid experience in Data or BI engineering dealing with large complex data scenarios\n\n\nAbility to work with varied data infrastructures including relational databases, column stores, NoSQL databases, and file-based storage solutions. Exposure to machine learning or machine learning pipelines is a plus. Ability to set up containerized services using Kubernetes and Docker.\n\n\nDesirable Requirements\n\n\nExperience with building and designing enterprise data pipelines with various levels of priority, concurrency, and versioning\n\n\nHere s our story; now tell us yours\nDell Technologies helps organizations and individuals build a brighter digital tomorrow. Our company is made up of more than 150,000 people, located in over 180 locations around the world. We re proud to be a diverse and inclusive team and have an endless passion for our mission to drive human progress.\nWhat s most important to us is that you are respected, feel like you can be yourself and have the opportunity to do the best work of your life -- while still having a life. We offer excellent benefits, bonus programs, flexible work arrangements, a variety of career development opportunities, employee resource groups, and much more.\nWe started with computers, but we didn t stop there. We are helping customers move into the future with multi-cloud, AI and machine learning through the most innovative technology and services portfolio for the data era. Join us and become a part of what s next in technology, starting today.\nApplication  closing date: 30th November 2022\nDell is committed to the principle of equal employment opportunity for all employees and to providing employees with a work environment free of discrimination and harassment. All employment decisions at Dell are based on business needs, job requirements and individual qualifications, without regard to race, color, religion or belief, national, social or ethnic origin, sex (including pregnancy), age, physical, mental or sensory disability, HIV Status, sexual orientation, gender identity and/or expression, marital, civil union or domestic partnership status, past or present military service, family medical history or genetic information, family or parental status, or any other status protected by the laws or regulations in the locations where we operate. Dell will not tolerate discrimination or harassment based on any of these characteristics. Dell encourages applicants of all ages. Read the full Employment Opportunity Policy here .\n,Other Details DepartmentGeneral / Other SoftwareSales / BDIndustry IT IT - Software EducationGraduation",
    "": ""
  },
  {
    "jobTitle": "Data Engineer Automotive",
    "jobDescription": "Job DetailsAs Senior Data Engineer for Automotive Business (m/f/d) you will actively shape the design and development of advanced analytics systems based on Big Data technologies. You will directly support our customers in the design of use cases and their technical implementation. Technologically, you work in the Apache Opensource toolstack with its large amount of tools and extensions. The main focus of your work will be in the areas of data engineering. In the related fields of Data Analytics and Data Science, you have a secure basic knowledge to work effectively with your colleagues specialized in this field. Activities include both the design of SW architectures and their implementation and transfer into operation. This includes, but is not limited to, the following activities: Development of customer use cases Implementation of customer projects with OpenSource SW components and commercial analysis software Implementation of data pipelines, monitoring and performance optimization in the context of product development or customer projects Design, technical architecture and implementation of Big Data solutions: End-to-end from brainstorming and proof of concept to production and continuous improvement. Analyze and extract business-critical insights from a variety of data sources, whether structured or unstructured Support of the sales during customer meetings and processing of customer-specific requirementsYour profileYou are an experienced Software Engineer with Focus on Automotive Business who can guide and inspire others. With drive and initiative, you tackle new challenges in the team, drive existing projects forward based on your own experience and develop an overall vision. You convince others with your personal appearance and have fun and experience in customer-oriented work.You have a Bachelor's or Master's degree in Computer Science, Mathematics, Business Information Systems, or similar and more than 8+ years of professional experience. You have experience and competence to design and develop data driven systems based on the technology stack. You evaluate and configure SW components, design and develop algorithms for customer solutions. You have extensive experience with various Apache Hadoop distributions (e.g. Cloudera, MapR) as well as the corresponding cloud hyperscaler variants (Azure, AWS, GCP). Your knowledge includes:Automotive data engineering Deep knowledge of overall automotive communication bus systems and data loggers advanced knowledge in Autosar and Flexray descriptions of ECUs communication protocolsHandling of unstructured data Handling of deeply nested, non-columnar binary data structures  Advanced knowledge of related software frameworks i.E. Google Protobuf Test and Verification StrategiesData Ingest Pipelines Software Architecture for data ingest pipelines Very Advanced coding skills in Scala + Java, Spark Framework using RDDsMemory and Runtime optimization for massive parallel processing algorithmsOther Knowledge of privacy and security challenges and solutions in loT and data analytics. Visionary thinking in translating business requirements into technological concepts and thinking ahead of new technologies Willingness to travel and enjoy working with customers directly on site Experience in visualization, communication and presentation of data and analytical results Very well written and verbal communication skills in the English language\"\"\" Key Skills: \"\"\"As Senior Data Engineer for Automotive Business (m/f/d) you will actively shape the design and development of advanced analytics systems based on Big Data technologies. You will directly support our customers in the design of use cases and their technical implementation. Technologically, you work in the Apache Opensource toolstack with its large amount of tools and extensions. The main focus of your work will be in the areas of data engineering. In the related fields of Data Analytics and Data Science, you have a secure basic knowledge to work effectively with your colleagues specialized in this field. Activities include both the design of SW architectures and their implementation and transfer into operation. This includes, but is not limited to, the following activities: Development of customer use cases Implementation of customer projects with OpenSource SW components and commercial analysis software Implementation of data pipelines, monitoring and performance optimization in the context of product development or customer projects Design, technical architecture and implementation of Big Data solutions: End-to-end from brainstorming and proof of concept to production and continuous improvement. Analyze and extract business-critical insights from a variety of data sources, whether structured or unstructured Support of the sales during customer meetings and processing of customer-specific requirementsYour profileYou are an experienced Software Engineer with Focus on Automotive Business who can guide and inspire others. With drive and initiative, you tackle new challenges in the team, drive existing projects forward based on your own experience and develop an overall vision. You convince others with your personal appearance and have fun and experience in customer-oriented work.You have a Bachelor's or Master's degree in Computer Science, Mathematics, Business Information Systems, or similar and more than 8+ years of professional experience. You have experience and competence to design and develop data driven systems based on the technology stack. You evaluate and configure SW components, design and develop algorithms for customer solutions. You have extensive experience with various Apache Hadoop distributions (e.g. Cloudera, MapR) as well as the corresponding cloud hyperscaler variants (Azure, AWS, GCP). Your knowledge includes:Automotive data engineering Deep knowledge of overall automotive communication bus systems and data loggers advanced knowledge in Autosar and Flexray descriptions of ECUs communication protocolsHandling of unstructured data Handling of deeply nested, non-columnar binary data structures  Advanced knowledge of related software frameworks i.E. Google Protobuf Test and Verification StrategiesData Ingest Pipelines Software Architecture for data ingest pipelines Very Advanced coding skills in Scala + Java, Spark Framework using RDDsMemory and Runtime optimization for massive parallel processing algorithmsOther Knowledge of privacy and security challenges and solutions in loT and data analytics. Visionary thinking in translating business requirements into technological concepts and thinking ahead of new technologies Willingness to travel and enjoy working with customers directly on site Experience in visualization, communication and presentation of data and analytical results Very well written and verbal communication skills in the English language\"\",Other Details DepartmentGeneral / Other SoftwareIndustry IT Management Consulting / Strategy EducationGraduation",
    "": ""
  },
  {
    "jobTitle": "Senior Specialist, Data Engineer & Analytics",
    "jobDescription": "Job Details\n\n  Job Title  : Senior Specialist Digital Marketing Data Engineer & Analytics(m/w/divers) \n  Job Location  : Bengaluru / India \n  Role Level  : Expert Level 2 \n\n  Start your journey of discovery - Bring your curiosity to life  \nA career at our company is an ongoing journey of discovery: our 57,000 people are shaping how the world lives, works and plays through next generation advancements in healthcare, life science and performance materials. For more than 350 years and across the world we have passionately pursued our curiosity to find novel and vibrant ways of enhancing the lives of others.\n\n  Senior Specialist Digital Marketing Data Engineer & Analytics   \nThe Marketing Operations team, located in Bengaluru, India is a key part of the global Digital & eCommerce Marketing department. The key focus of this team is to build automated and scaled solutions that will enable Digital Marketing to become the primary growth driver of the digital business. As such, this team collaborates cross-functionally with various marketing teams in and outside of the Digital & eCommerce organization.\n\nReporting to the Head of Marketing Operations, you will be responsible for developing, maintaining, and evolving reporting capabilities for various digital marketing channels. This is a great opportunity for someone to get exposure to various aspects of marketing and eCommerce business. \n\nWe are looking for a new team member who is analytical and passionate about data and marketing. You are passionate about and experienced in handling, analysing, and visualizing data  Come and work in one of the leading eCommerce businesses in the Life Science category. \n\n  Key Accountabilities  \n\nDevelop, validate, scale, and deliver analytical solutions aimed at maintaining data quality\nWork with  integrated data solutions such as data lakes and data warehouses \nCollaborate with analytics and data science teams to design and plan data engineering solutions\nEnsure data accuracy and completeness by performing quality data audits and analyses.\nSupport data-informed business decisions \nSupport ETL and other data engineering tasks for a customer data platform.\nDevelop and implement strategies and best practices to ensure appropriate access control and security of stored data for that customer data platform.\nPerform explorative analyses to identify potential drivers for revenue or other substantial key business drivers or root causes of problems. \nSupport business decisions by providing data analysis and reporting of patterns, insights, and trends to decision-makers.\nSupport the development and evolution of marketing measurement frameworks, actionable reports and interactive dashboards using reporting and visualization tools\nTranslate data into actionable insights - make recommendations to team members & stakeholders to improve channel or functional health.\n\n\n\n  Minimum Qualifications:  \n\nBachelor's Degree in Computer Science, Data Analytics, Statistics, Applied Math, Data Science, or technical discipline\n4+years of experience with data management, structuring, and engineering\n4+ years of experience with Cloud Computing Platforms (Google Cloud Platform preferred); Structured Query Language (SQL);SQL and NoSQL Databases; ETL Tools (Talend, Pentaho, DataFlow, Airflow, Kafka)\n3+ years of experience with programming skills such as Java, C/C++, Scala, and/or R with Python experience strongly preferred\n\n\n  Preferred Qualifications:  \n\nMaster s Degree in Computer Science, Data Analytics, Statistics, Applied Math, Data Science, or technical discipline\nDegree in a life science related discipline and MBA or Ph.D. is a bonus\nData Engineering Certification (Google s Certified Professional-Data-Engineer, IBM Certified Data Engineer Big Data, CCP Data Engineer for Cloudera, etc)\nExperience with Digital Analytics tools such as Google Analytics or Adobe Analytics\nExperience with and demonstrated ability to apply reporting and data visualization tools such as Tableau or Google Data Studio\nWorking understanding of machine learning methods\nAbility to conduct complex, important work independently\nHighly skilled in developing data pipelining solutions and architecting cloud data\nMarketing technology such as marketing automation, customer data platforms, customer relationship management, \nGeneral understanding of marketing channels and functions or deep, practical expertise of a single digital marketing channel and function. \n\n\n  Key Behaviors   \n\nEnthusiastic, self-motivated, and proactive, with a solution-oriented mindset\nAbility to utilize the available time to organize and complete work within given deadlines\nMeticulous attention to detail, with an overall passion for continual improvement \nLogical and methodical approach to problem-solving\nAbility to communicate effectively with others verbally and in writing clearly and concisely\n\n\n  What we offer  \nWith us, there are always opportunities to break new ground. We empower you to fulfill your ambitions, and our diverse businesses offer various career moves to seek new horizons. We trust you with responsibility early on and support you to draw your own career map that is responsive to your aspirations and priorities in life. Join us and bring your curiosity to life! Curious  \nApply and find more information at https://jobs.vibrantm.com\n\n What we offer: We are curious minds that come from a broad range of backgrounds, perspectives, and life experiences. We celebrate all dimensions of diversity. We believe that it drives excellence, innovation, and human progress. We care about our customers, patients, and our rich mix of people. This diversity strengthens our ability to lead in science and technology. We are committed to creating access and opportunities for all and empower you to fulfil your ambitions. Our diverse businesses offer various career moves to seek new horizons. Join us in building a culture of inclusion and belonging that impacts millions and empowers everyone to bring their curiosity to life!\n,Other Details DepartmentGeneral / Other SoftwareIndustry IT Pharma / Biotech EducationGraduation",
    "": ""
  },
  {
    "jobTitle": "Data Engineer",
    "jobDescription": "Job Details\nDesigning, creating, deploying and managing Data Architecture. Defining, in alignment with IT Business Intelligence Organisation, how the data will be stored, consumed, integrated and managed within Cloudera or other repositories, as well as any applications using or processing that data. Handling the linkages and transformations between different databases, merging and aggregating data. Creation and oversight of architecture maps for projects like Daylight (ERP Big Data) and ES Americas DataHub, to ensure people can understand and navigate through the data complexity.\nData sources will include (but not be limited to), multiple ERPs (SAP, Oracle, etc.), other enterprise business tools (Demantra, TPH, PDH, EPM, etc), other bespoke business tools (Customer Stock Assortment, Channel Charter Lead Times, Report Distribution Database, KPI Target Setting).\nOversight of the design of Bespoke Business Tools, with respect to Database architecture. Including but not limited to: Customer Stock Assortment, Channel Charter Lead Times, Report Distribution Database, KPI Target Setting.\nIdentification of Data Cleansing requirements within Eaton Electrical Sector EMEA s Data sets. Working with other stakeholders to develop and effective and robust cleansing processes and algorithms and validating them. Ensuring that data is clean and useable by the Organisation.\nWorking closely with other Business Groups within Eaton, including but not limited to: Material Master Data Management Team; Customer Master Data Management Team; Material Management Team; Product Data Stewards; IT Business Intelligence; IT; Supply Chain Shared Services in Pune (India) and Budapest; Transport Operations: Distribution Operations; Sales and Marketing Analytics; etc.\nEnsuring that the tools and approaches that Eaton uses are appropriate for the current and future needs of the business: scalable; robust; with a good product life-span; managing massive data; delivering quick outputs for business users; are useable by the front-end tools.\nAdditionally, support for other ad-hoc Data related projects for Eaton Globally\n\nIdentifies opportunities to collect new data.\nDesigns new processes and builds large, complex data sets.\nDevelops solutions to gather data to deliver Business Tools that add value to the business\nStrategizes new uses for data and its interaction with data design.\nLocates data sources, analyzes statistics and implements quality procedures.\nPerforms data studies of new and diverse data sources.\nFinds new uses for existing data sources.\nTests and validates predictive models.\nConducts scalable data research.\nImplements automated processes for efficiently producing scale models.\nDesigns, modifies and builds new data processes.\nCollaborates with stakeholders, IT, database engineers and other scientists.\nDevelops and maintains scalable data pipelines and builds out new API integrations to support continuing increases in data volume and complexity.\nCollaborates with analytics and business teams to improve data models that feed business intelligence tools, increasing data accessibility and fostering data-driven decision making across the organization.\nImplements processes and systems to monitor data quality, ensuring production data is always accurate and available for key stakeholders and business processes that depend on it.\nWrites unit/integration tests and documents work.\nPerforms data analysis required to troubleshoot data related issues and assist in the resolution of data issues.\nWorks closely with a team of frontend and backend engineers, product managers, and analysts.\nDefines company data assets (data models), Impala, spark, sparkSQL, and hiveSQL jobs to populate data models.\nDesigns data integrations and data quality framework.\nDesigns and evaluates open source and vendor tools for data lineage.\nWorks closely with all business units and engineering teams to develop strategy for long term data platform architecture.\n\nQualifications\nQualifications :\n\nBachelor s degree and master s degree in Computer Science , IT or equivalent work experience\nUnderstanding of and ability to use programming languages like Python and Database query language like SQL (Structured Query Language)\nDisplays superior data visualization abilities\nDisplays superior technical coding abilities\nWorking knowledge of Power BI\nKnowledge of any ETL tools like Talend, Informatica etc\nSolid experience in Python\nKnowlegde of Cloudera\nKnowledge of different types of Databases (Relational, Graphic )\nStrong Data Manipulation skills, working with large datasets\nExperience within large data environments (Cloudera, OBIEE, etc)\nKnowledge of Data Science is good to have\n,Other Details DepartmentGeneral / Other SoftwareIndustry IT Engineering / Construction EducationGraduation",
    "": ""
  },
  {
    "jobTitle": "Senior Data Engineer",
    "jobDescription": "Job Details\nMust have experience in Bigdata and Snowflake\nMust have worked on Snowflake data migration form on prem to cloud or from any other traditional dbs , Scalability, Data Storage Formats, concurrency requests, streaming data ingestion.\nAbility to build quick Proof of concept as per the requirements.\nAnalysis on large amounts of historical data, determining suitability for Data Lake, Delta Lake setup, data clean-up, data management and filtering, loading into Snowflake.\nConducting experiments with different types of data models, analyzing performance, to identify the best ways to employ.\nExpertise in Snowflake advanced concepts like setting up resource monitors, RBAC controls, virtual warehouse sizing, query performance tuning, zero copy clone, time travel and understand how to use these features.\nStrong Proficiency in RDBMS, complex SQL, PL/SQL, Python, performance tuning\nExpertise in Snowflake concepts like setting up resource monitors, RBAC controls, virtual warehouse sizing, query performance tuning, zero copy clone, time travel and understand how to use these features\nOther Details DepartmentEmbedded / System SoftwareGeneral / Other SoftwareIndustry IT IT - Software",
    "": ""
  },
  {
    "jobTitle": "Senior Data Engineer",
    "jobDescription": "Job DetailsShould be able to individually attend client calls and perform requirement gathering and prepare required documents.\nShould be good in debugging and analyzing the issues and resolve in a timely manner.\nShould be an expert in development of real time and batch using Informatica application integration and data Integration.\nShould have good knowledge in ETL process, standards, and best practices to develop complex Informatica processes, mappings, workflows. Need to perform production support activities.\nShould be able to manage multiple tasks and be able to communicate the status to the customer in a timely manner. Write advanced SQL Queries and PL/SQL code to support ETL Development.\nStrong skills on ETL design patterns and integration architecture for Middleware design and implementation.\nCandidate should have very good experience on SCD type 2 implementation, Incremental Strategy implementation using Informatica ETL.\nShould be open to learn new technologies.Other Details DepartmentGeneral / Other SoftwareIndustry IT IT - Software",
    "": ""
  },
  {
    "jobTitle": "Principal Data Engineer",
    "jobDescription": "Job DetailsAs a Technical Director, you will be responsible for team management, team leadership as well as hands on technical deliverables as part of a high performing technology organization.\n\n\nResponsibilities\n- Leads holistic data and platform evolution in our cloud environment through supporting multi product verticals, product feature implementation, CI/CD as well as building and maintaining a security posture which includes proactively identifying security risks and implementing both risk mitigation plans and control functions\n- Provides consultation throughout Ethoca, ensuring infrastructure and database performance through advanced data modeling, query tuning, and indexing strategies\n- Leads initiatives with internal customers across development verticals to drive project completion, overseeing several large initiatives around system and platform performance, providing project direction and technical advice\n- Plans and implements process improvement efforts to identify and test opportunities for automation and/or reduction in time to deployment\n- May perform financial planning, forecasting, and budget tracking to reduce total cost of ownership and allocate resources efficiently\n- Provides corporate leadership, vision, and direction for data systems, ensuring support of companys objectives and requirements\n- Build and lead a team of high performing technology resources to execute on product deliverables and platform responsibilities\n\n\nExperiences\n- Successfully led complex cross-functional domain initiatives, expected to set project direction and anticipate/resolve challenges and escalations\n- Proven ability in setting priorities, objectives, and driving deliverables within data technology domains and sub-domains, understanding the financial and technological impact of these designs\n- Experience participating in a major automation and/or cloud delivery effort, including supporting financial decision making\n- Experience teaming with leaders in the technical community to derive new solutions and drive quality and consistency globally\n- Experience identifying potential opportunities for automation optimization and/or reduction in time to deployment\n- Acts as a trusted advisor for Ethocas business and functions internally and at industry events\n- Proficiency with cloud technologies (IaaS, PaaS, serverless technology, NoSQL databases), micro-service design, DevOps\n- Degree in Computer Science, or a related technical field including programming\n- Excellent SQL and higher-level programming language\n- Strong analytical and excellent problem-solving skills\n- Good understanding of 12-Factor App methodology\n- Proficiency in multiple programming languages such as NodeJS, Java, Java Script, etc. are mandatory\n\n\nIdeally you have experience in banking, e-commerce, credit cards or payment processing and exposure to both SaaS and premises-based architectures. In addition, you have a post-secondary degree in computer science, mathematics, or quantitative science.\n\n\nCorporate Security Responsibility\nEvery person working for, or on behalf of, Mastercard is responsible for information security. All activities involving access to Mastercard assets, information, and networks comes with an inherent risk to the organization and therefore, it is expected that the successful candidate for this position must:\n- Abide by Mastercards security policies and practices;\n- Ensure the confidentiality and integrity of the information being accessed;\n- Report any suspected information security violation or breach, and\n- Complete all periodic mandatory security trainings in accordance with Mastercards guidelines.,Other Details DepartmentGeneral / Other SoftwareIndustry IT Banking / Financial Services EducationGraduation",
    "": ""
  },
  {
    "jobTitle": "AVP Principal Data Engineer (L11)",
    "jobDescription": "Job DetailsRole Summary/Purpose:\n\nWe are looking for a Principal Data Engineer to lead the development of consumer-centric low latency analytic environment leveraging Big Data technologies and transform the legacy systems. This role is an exciting, fast-paced, constantly changing, and challenging work environment, and will play an important role in resolving and influencing high-level decisions across Synchrony.\n\nThis position is remote, where you have the option to work from home. On occasion we may request for you to commute to our nearest office for in person engagement activities such as team meetings, training and culture events. To ensure the safety of our colleagues and communities, we require employees who come together in-person to be fully vaccinated. Were proud to offer you choice and flexibility.\n\nEssential Responsibilities:\n\nUnderstand and manage the data needs of stakeholders across multiple agile teams.\nLead the design & implementation of scalable & fault tolerant data applications on Big-Data & Cloud Platforms to store & process terabytes of data from upstream sources with high availability.\nEngage with and take direction from information architects, platform architects, data scientists and product management on solution requirements to design solutions.\nContribute to high impact problems/projects through in-depth evaluation of complex business processes, system processes, enterprise standards & procedures.\nEnforce data management standards and procedures\nLead design, development, testing oversight and production implementation using Spark, Hive, Kafka, RDBMS (Oracle, MySQL), NoSQL databases (Cassandra), Ab Initio and AWS.\nPartner with multiple teams to ensure appropriate data solutions to meet goals as well as identify and define necessary system and process enhancements.\nProvide technical leadership for data engineering agile teams to deliver against sprint and program increment objectives.\nWork closely with Product Owners, Product Managers, Program Manager, Scrum Masters and Team Members in a Scaled Agile framework.\nStay up to date on latest trends in data engineering and recommended best practices.\nDevelop innovative frameworks to avoid redundancy by promoting automation.\nMentor and coach data engineering team members to promote Synchrony values and culture.\nQualifications/Requirements:\n\nBachelors degree in Computer Science, Engineering, or a related field with minimum of 8+ years of experience in Technology in the consumer banking industry or in lieu of degree 10+ years of experience in Technology\nExperience in ETL/Data warehousing with 6+ years of experience with large scale Big Data environments such as Hortonworks/Cloudera and public cloud (AWS preferred).\nPrior experience as a Hadoop Technical Lead / Architect\nStrong experience and deep understanding of ETL, data warehousing, data lake technologies (Hadoop & Spark) and analytics concepts.\nExperience owning a mission critical application on a big data platform.\nExperience with batch and real-time data pipelines in a DevOps environment.\nWilling to work in a fast-paced environment with globally located Agile teams working in different shifts.\nAbility to develop and maintain strong collaborative relationships at all levels across IT and Business Stakeholders.\nExcellent written and oral communication skills. Adept and presenting complex topics, influencing and executing with timely / actionable follow-through.\nFor Internal Applicants: Understand the criteria or mandatory skills required for the role, before applying.\nInform your Manager or HRM before applying for any role on Workday.\nEnsure that your Professional Profile is updated (fields such as Education, Prior experience, Other skills) and it is mandatory to upload your updated resume (Word or PDF format)\nMust not be any corrective action plan (First Formal/Final Formal, PIP)\nEmployees who have completed 18 months in the organization and 12 months in current role and level are only eligible.\nLevel 9+ employees can apply\nDesired Characteristics:\n\nPrior work experience in a Credit Card/Banking/Fin Tech company.\nExperience dealing with sensitive data in a highly regulated environment.\nDemonstrated implementation of complex and innovative solutions.\nDemonstrated leadership capabilities amongst peers and within prior teams.,Other Details DepartmentGeneral / Other SoftwareIndustry IT Banking / Financial Services EducationGraduation\"jobTitle",
    "": "jobDescription"
  },
  {
    "jobTitle": "Machine Learning Engineer (DevOps)",
    "jobDescription": "Job Details\nMachine Learning Engineer (DevOps)\nOur data scientists & engineers are helping to shape our marketing strategy for a digital world and at scale. We are looking for a DevOps Engineer to take care of our Machine Learning Models in production.\nJoin us as a DevOps  Engineer on our Machine Learning team in Bangalore/Remote to do the best work of your career and make a profound social impact.\nWhat you'll achieve\nThis position will merge DevOps, software engineering, data science, and data engineering to deploy machine learning models that can optimize business and customer experiences at scale. You will use your technical knowledge and software development to build technology-centric solutions that accelerate the development of Artificial Intelligence and Machine Learning capabilities across the company.\nYou will take out the debate of what can be launched and when. The models that we build are essential ingredients to supply our customers & sales with relevant product recommendations and creative breakthroughs to our business. You & your team are critical for our success!\nYou will:\n\n\nDevelop high availability and highly scalable applications which will be used by both internal and external customers.\n\n\nParticipate in product development in all stages from planning and design to development, testing and documentation of ML solutions and data products.\n\n\nGenerate technical documentation as well as unit and functional tests .\n\n\nAdhere to DevSecOps practices to protect underlying data/infrastructure assets\n\n\nUtilize a range of applicable technologies across the entire Model Lifecycle (e.g., data science packages, statistical and machine learning techniques, distributed computing, Big Data, CI/CD).\n\n\nTake the first step towards your dream career\nEvery Dell Technologies team member brings something unique to the table. Here s what we are looking for with this role:\nEssential Requirements:\n\n\nEngineering Degree in Computer Science/Engineering and minimum of 5 years of working experience in the field\n\n\nStrong hands-on experience in Linux/Cloud environment and scripting languages as Python and Shell. Experience designing and developing APIs in Python (FastAPI, Flask or Django).\n\n\nExperience with Python testing frameworks such as unittest or pytest\n\n\nExcellent knowledge of software development and software testing methodologies along with configuration management practices in Linux-based environments.\n\n\nDemonstrated Experience writing and maintaining high quality code as well as documentation. Experience working with Docker, Kubernetes in a microservices architecture\n\n\nDesirable Requirements:\n\n\nStrong mathematical knowledge and advanced statistical analysis skills. Experience in automating Continuous Integration, Continuous Delivery and Agile practices for highly scalable systems\n\n\nMachine Learning or Artificial Intelligence experience. Experience working with message brokers (RabbitMQ, Kafka) is an advantage\n\n\nHere s our story; now tell us yours\nDell Technologies helps organizations and individuals build a brighter digital tomorrow. Our company is made up of more than 150,000 people, located in over 180 locations around the world. We re proud to be a diverse and inclusive team and have an endless passion for our mission to drive human progress.\nWhat s most important to us is that you are respected, feel like you can be yourself and have the opportunity to do the best work of your life -- while still having a life. We offer excellent benefits, bonus programs, flexible work arrangements, a variety of career development opportunities, employee resource groups, and much more.\nWe started with computers, but we didn t stop there. We are helping customers move into the future with multi-cloud, AI and machine learning through the most innovative technology and services portfolio for the data era. Join us and become a part of what s next in technology, starting today.\nApplication  closing date: 30th November 2022\nDell is committed to the principle of equal employment opportunity for all employees and to providing employees with a work environment free of discrimination and harassment. All employment decisions at Dell are based on business needs, job requirements and individual qualifications, without regard to race, color, religion or belief, national, social or ethnic origin, sex (including pregnancy), age, physical, mental or sensory disability, HIV Status, sexual orientation, gender identity and/or expression, marital, civil union or domestic partnership status, past or present military service, family medical history or genetic information, family or parental status, or any other status protected by the laws or regulations in the locations where we operate. Dell will not tolerate discrimination or harassment based on any of these characteristics. Dell encourages applicants of all ages. Read the full Employment Opportunity Policy here .\n,Other Details DepartmentEngineering Design / ConstructionGeneral / Other SoftwareIndustry IT IT - Software EducationGraduation",
    "": ""
  },
  {
    "jobTitle": "Data Science and Machine Learning Trainer",
    "jobDescription": "Job DetailsA person who is well versed with Data Science Machine Learning and who has hands on Data Science, Python, Panda, Matplotlib etc.,Other Details DepartmentTechnical / Process TrainingIndustry IT Education / Training",
    "": ""
  },
  {
    "jobTitle": "Apply for-  Machine Learning Engineer Sr. Associate",
    "jobDescription": "Job DetailsWe are looking for a Data Scientist/ML Engineer to join our technology team to solve exciting business problems in the domain of commercial banking, payments and financial services. Candidates must have a strong curiosity for data and a proven track record of successfully applying rigorous scientific methods with proficiency in ML Engineering and DevOps capabilities. This is a unique opportunity to apply your skills and have a direct impact on global business.\n The ideal candidate will have a strong knowledge of ML, NLP, Deep Learning, Knowledge Graphs and have experience working with massive amounts of data. They should also have strong software engineering skills and the ability to build systems that reach JP Morgan scale.\nWhat You'll Do:\n\nBuild and train production grade ML models on large-scale datasets to solve various business use cases for Commercial Banking.\nUse large scale data processing frameworks such as Spark, AWS EMR for feature engineering and be proficient across various data both structured and un-structured.\nUse Deep Learning frameworks like CNN, RNN, LSTM and Attention for solving use cases requiring semantic search, named entity resolution, forecasting, anomaly detection among many other techniques\nBuild ML models across Public and Private Cloud environments including container-based Kubernetes environments.\nDevelop end-to-end ML pipelines necessary to transform existing applications and business processes into true AI systems.\nBuild both batch and real-time model prediction pipelines with existing application and front-end integrations. \nYou will collaborate to develop large-scale data modeling experiments, evaluating against strong baselines, and extracting key statistical insights and/or cause and effect relations.\n\n\nBasic Qualifications:\n\nAdvanced Degree in field of Computer Science, Statistics, Mathematics or Data Science or equivalent discipline.\nMinimum 3+ years of working experience as a data scientist\nExpertise with Python, PySpark, DL frameworks like TensorFlow/PyTorch and GPU usage.\nIntroductory working knowledge in ML Ops frameworks such as model deployment tools (Rest API, Sagemaker, Containerization, AWS EMR), Database concepts, API concepts, Model Monitoring and management concepts\n\n\nExperience in designing and building highly scalable distributed ML models in production \nWorking knowledge with analytical tools (ex: SQL, Hive, Presto, Spark, Python, AWS suite)\n\n\nExperience with machine learning techniques and advanced analytics (e.g. regression, classification, clustering, time series, econometrics, causal inference, mathematical optimization)\n\n\nExperience with AWS is a plus\nExperience working with end-to-end pipeline frameworks like Sagemaker, crowd-sourced data labeling a plus\n,Other Details DepartmentGeneral / Other SoftwareSales / BDIndustry IT Banking / Financial Services EducationGraduation",
    "": ""
  },
  {
    "jobTitle": "Associate, Machine Learning Engineer, Investment and Trading Technology",
    "jobDescription": "Job DetailsResponsibilities \n\nResearch and implement appropriate ML algorithms and tools\nDevelop machine learning applications according to requirements\nSelect appropriate datasets and data representation methods\nRun machine learning tests and experiments\nPerform statistical analysis and fine-tuning using test results\nExtend existing ML libraries and frameworks\n\n Requirements  \n\nGood understanding and knowledge in Python and libraries like NumPy & Pandas\nGood knowledge of math, probability, statistics and algorithms\nGood Understanding of UNIX\nGood Knowledge in NLP, Regression and clustering\nGood knowledge in any MLOPS frameworks\nKnowledge in Kedro\nDeep Learning modelling.\n,Other Details DepartmentStatistics / AnalyticsIndustry IT Banking / Financial Services EducationGraduation",
    "": ""
  },
  {
    "jobTitle": "Machine Learning Engineer_BANGALORE",
    "jobDescription": "Job DetailsRequired Technical and Professional Expertise\n\n6 to 8 Years of experience\nML OPS with Data science/ key words:- ML algorithum implementation, python, R programming , data structure, data modelling, software architechture\nlearning oriented programming languages/platforms and Data Visualization tools\nExperience or understanding of end-to-end software tool/solution development and life cycle management\nPrior experience of having worked in consulting/product/analytics environment.\nExperience in Data Science/Analytics with demonstrated track of generating value through DS/ML/AI solutions.\nShould have full understanding of applications of DS/ML/AI solutions to various business problems\nProficiency in using databases like Teradata, NoSQL and Hadoop using SQL, Hive, Spark.\nOther Details DepartmentEngineering Design / ConstructionIndustry IT IT - Software EducationGraduation",
    "": ""
  },
  {
    "jobTitle": "Machine Learning Engineer _BANGALORE",
    "jobDescription": "Job DetailsRequired Technical and Professional Expertise\n\n6 to 8 Years of experience\nML OPS with Data science/ key words:- ML algorithum implementation, python, R programming , data structure, data modelling, software architechture\nlearning oriented programming languages/platforms and Data Visualization tools\nExperience or understanding of end-to-end software tool/solution development and life cycle management\nPrior experience of having worked in consulting/product/analytics environment.\nExperience in Data Science/Analytics with demonstrated track of generating value through DS/ML/AI solutions.\nShould have full understanding of applications of DS/ML/AI solutions to various business problems\nProficiency in using databases like Teradata, NoSQL and Hadoop using SQL, Hive, Spark.\nOther Details DepartmentEngineering Design / ConstructionIndustry IT IT - Software EducationGraduation",
    "": ""
  },
  {
    "jobTitle": "Lean SigmaSenior Data Scientist Data & Analytics",
    "jobDescription": "Job DetailsRole & Responsibilities Work closely with global & regional teams to architect, develop, and maintain advanced reporting and data visualization capabilities on large volumes of data to support analytics and reporting needs across products, markets and services. Obtain data from multiple sources, collate, analyze, and triangulate information to develop reliable fact bases. Effectively use tools to manipulate large-scale databases, synthesizing data insights. Execute cross-functional projects using advanced modeling and analysis techniques to discover insights that will guide strategic decisions and uncover optimization opportunities. Build, develop and maintain data models, reporting systems, dashboards and performance metrics that support key business decisions. Extract intellectual capital from engagement work and actively share tools, methods and best practices across projects  Provide 1st level insights/conclusions/assessments and present findings via Tableau/PowerBI dashboards, Excel and PowerPoint.  Apply quality control, data validation, and cleansing processes to new and existing data sources. Lead, mentor and guide more junior team members. Communicate results and business impacts of insight initiatives to stakeholders in leadership, technology, sales, marketing and product teams. Bring your Passion and ExpertiseAll About You  Experience in data management, data mining, data analytics, data reporting, data product development and quantitative analysis  Financial Institution or a Payments experience a plus Experience presenting data findings in a readable and insight driven format. Experience building support decks. Advanced SQL skills, ability to write optimized queries for large data sets (Big data) Experience on Platforms/Environments: Cloudera Hadoop, Big data technology stack, SQL Server, Microsoft BI Stack Experience with data visualization tools such as Looker, Tableau, PowerBI Experience with Python, R, a plus,Other Details DepartmentGeneral / Other SoftwareIndustry IT Banking / Financial Services EducationGraduation",
    "": ""
  },
  {
    "jobTitle": "Engineer - GBS Engineering",
    "jobDescription": "Job DetailsJob Summary\nTo support our extraordinary teams who build great products and contribute to our growth, were looking to add a Engineer  GBS Engineering in Pune.\n\nWhat a typical day looks like:\n\nIntense collaboration\n\nPassionate customer focus\n\nThoughtful, fast, disciplined execution\n\nTenacious commitment to continuous improvement\n\nRelentless drive to win\n\nEfficiently managing ECOs for manufacturing sites across the globe\n\nUse Agile (PLM) system for ECO (Engineering Change Order) creation, reviewing , routing, tracking, releasing and distribution\n\nWork closely with Engineering and materials teams to review product updates / modifications\n\nCreating setup like product Number, BOM Structure etc in AGILE & BAAN for new Products\n\nCreating part numbers for BOM in agile & Baan\n\nCreating AVL in agile & Baan system\n\nDownloading customer documents like product specifications etc & releasing same in CDC\n\nWork as a Change Analysts during NPI for new changes\n\nRelease Part list to production for new models & after implementation of ECO's\n\nPerform Quarterly / Annual performance appraisals for the team members\n\nEnsure adherence to targets set for all Process Metrics\n\nEnsure timely generation and circulation of reports / dashboards\n\nMentor the team and guide them towards effective discharge of functions\n\nHandle escalations if any, and escalate matters requiring the senior managements attention on a timely basis\n\nTrain new and existing team members on an ongoing basis on relevant tools or topics\n\nPerform root cause analysis to expedite the resolution of service issues\n\nIdentify, recommend, and implement operational efficiencies to drive continuous improvement in the execution of procurement processes\n\nPrepare Customized reports for analyzing and incorporating improvements in processes\n\nThe experience were looking to add to our team:\n\nBasic understanding of quality tools and techniques, interface with customers on quality issue, improvement initiatives and audits\n\nManage Project from initiation through transfer, ensure timeline and documentation, direct team to resolve issues, develop status report\n\nWork closely with the FE team and the customer/site to provide an efficient and comprehensive service; establish and maintain solid relationships.\n\nInitiate continues Improvement technique to eliminate non value added activities, implement best practices in processes.\n\nActive Coordinates in interviewing, hiring, terminations, promotions, performance review\n\nPlan, design, and develop relevant training programs and evaluation technique based on renowned approach or methodology\n\nHave a knowledge of IP, Copyrights, regulations, policies and procedures\n\nHand on experience with MS Office, basic understanding of RPA, Artificial Intelligence and Machine Learning, and ERP system\n\nDemonstrates advanced functional, technical and people and/or process management skills as well as customer (external and internal) relationship skills.\n\nMust have knowledge of relevant regulatory standards and applicable regulations\n\nExcellent written and verbal communication skills\n\nEffective team building and delegation skills\n\nGood analytical and problem-solving skills\n\nMust have good interpersonal and crucial conversation skills.\n\nTypically requires a bachelors degree in a related field or equivalent experience and training.\n\nMinimum 3-5 years of engineering experience.,Other Details DepartmentGeneral / Other SoftwareIndustry IT IT - Software EducationGraduation",
    "": ""
  },
  {
    "jobTitle": "We are Hiring - Software Development Engineer",
    "jobDescription": "Job DetailsAmazon has come a long way since opening on the World Wide Web in July 1995. Today, we operate retail websites in multiple countries across geographies, offering products in many categories (books, media, digital, electronics etc.) worldwide, and we still like to work hard, have fun and make history! The Amazon.com brand has become synonymous with a superior level of convenience, selection, low prices, and customer service.Software Development Engineers Worldwide Transportation Engineering @ Delhi, IndiaAmazon s global fulfillment network enables any merchant in any of the geography ship items that you order on Amazon, to any place on earth. There are a variety of ways in which we can acquire items from vendors to our warehouses, ship items from one location to another, and several intermediate locations through which the package travels before reaching the customer. There are millions of such packages, each with different attributes, and different delivery requirements. What results is a highly dense graph of source, intermediate and destination nodes, with arcs between them representing possible paths for packages, with different costs and times along each arc. Accounting for all these constraints, and maximizing the number of shipments shipped, while minimizing cost, providing a variety of delivery options and maximizing delivery performance is Transportation Engineering's primary focus.In 2006, Amazon started building Technology teams at Delhi to support the growth in the global fulfillment and transportation network. We have built a world class Software engineering team which is focused on solving some of the complex problems in worldwide Transportation using workflows, optimization algorithms, machine learning systems etc. These are large scale distributed systems handling millions of packages being shipped through our networkWe are looking for Software Development Engineers with solid Software engineering fundamentals involving solving complex problems. He/She will get to work on some of the key initiatives planned to support our rapid evolution and growth of the transportation network and in the process solve some of the most challenging problems. These engineers will grow to provide the technical leadership to the team, drive best practices, mentor other engineers and drive continuous improvements in engineering excellence., \nBachelor or Master in computer science\nSolid professional experience in software development\nAdvocate for solutions to technical challenges, articulating schedule/risk/quality trade-offs\nCollaborate across disciplines for positive, productive teamwork\nDemonstrated ability to go the extra mile to do things right and fast\nParticipate in design and architecture sessions with other senior technical leads\nProduce quality, innovative, debuggable, testable and maintainable code\nLearn new things, fail fast, and explore new coding territory\n\n\nProgramming experience in Java and frameworks such as JEE/Spring/Hibernate\nAdvanced SQL knowledge\nKnowledge of professional software engineering practices & best practices for the full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations\nAbility to learn new languages and technologies quickly\nExperience in communicating with business teams, other development teams, and management to collect requirements, describe software product features, and technical designs\nKnowledge of AWS/Cloud technologies\nOther Details DepartmentWeb / Mobile TechnologiesSales / BDIndustry IT IT - Software EducationGraduation",
    "": ""
  },
  {
    "jobTitle": "Recruit for the post of Software Senior Engineer",
    "jobDescription": "Job DetailsJob Posting\n\nSoftware Senior Engineer\nISG-CEE team is looking for a hands-on, passionate, results-oriented, inventive software engineer to work in ISG-CEE team. Candidates should understand software development, have excellent debugging and troubleshooting skills, be able to deliver quick fixes for, have excellent communication skill, and be eager to improve product quality and reliability.\nThe Software Engineering team delivers next-generation software application enhancements and new products for a changing world. Working at the cutting edge, we design and develop software for platforms, peripherals, applications, and diagnostics all with the most advanced technologies, tools, software engineering methodologies and the collaboration of internal and external partners.\nJoin us as a Software Senior Engineer on our ECS (Elastic Cloud Storage)/Objectscale Engineering team in Bengaluru to do the best work of your career and make a profound social impact.\nWhat you ll achieve\nAs a Software Senior Engineer, you will join a high-performing team to build cutting-edge s3 compatible object storage products and solutions that will transform people s daily lives. You will work with core product development, product management, support, pre-sales teams to deliver top solutions for real-world requirements on ECS/ObjectScale products.\nYou will:\n\nBe responsible for the design and development of high-quality code solutions.\nDebug and resolved customer issues at the highest level, work with product component owners to resolve real-world issues, deliver code fixes as per the requirement.\nDesign and build configurable and scalable tools for debugging purpose.\nParticipate in on-call rotations to support the product outside of business hours\n\nTake the first step towards your dream career\nEvery Dell Technologies team member brings something unique to the table. Here s what we are looking for with this role:\nEssential Requirements \n\nBachelor, master s degree in computer science or equivalent areas.\n6-8 years of Java based enterprise software development experience.\nStrong experience in Core Java,OOP,Spring, REST API and Design patterns.\nStrong systems fundamentals in Distributed computing, large-scale software architecture and performance.\nProficient in Python Programming Language. Deep Knowledge in Linux/Unix Operating System (Networking, Log processing, Processes, Memory, Storage etc.)\n\nDesirable Requirements \n\nExperience in working with large distributed systems, file system, storage system is a big plus.\nKnowledge of container technology Kubernetes, Docker.\n\nHere s our story; now tell us yours\nDell Technologies helps organizations and individuals build a brighter digital tomorrow. Our company is made up of more than 150,000 people, located in over 180 locations around the world. We re proud to be a diverse and inclusive team and have an endless passion for our mission to drive human progress.\nWhat s most important to us is that you are respected, feel like you can be yourself and have the opportunity to do the best work of your life while still having a life. We offer excellent benefits, bonus programs, flexible work arrangements, a variety of career development opportunities, employee resource groups, and much more.\nWe started with computers, but we didn t stop there. We are helping customers move into the future with multi-cloud, AI and machine learning through the most innovative technology and services portfolio for the data era. Join us and become a part of what s next in technology, starting today.\nYou can also learn more about us by reading our latest Diversity and Inclusion Report and our plan to make the world a better place by 2030 here .\n \nOther Details DepartmentEmbedded / System SoftwareGeneral / Other SoftwareIndustry IT IT - Software EducationGraduation\"jobTitle",
    "": "jobDescription"
  },
  {
    "jobTitle": "Python Developer",
    "jobDescription": "Job Details                                                                                      Role:  Python Developer\nJob Description: We are looking for a Python Web Developer responsible to build functional and efficientserver-side applications, managing the interchange of data between the server and the users.Your primary focus will be the development of all server-side logic, ensuring high performanceand responsiveness to requests from the front-end. You will also be responsible for integratingthe front-end elements built by your co-workers into the application\nKey Responsibilities:\nHelp design and implement functional requirementsBuild efficient back-end features in PythonIntegrate front-end components into applicationsWriting reusable, testable, and efficient codeManage testing and bug fixesPrepare technical documentationCollaborate with UX/UI designers to implement design into the codeCoach junior team membersImplement software enhancements and suggest improvementsDeveloping digital tools to monitor online traffic\nRequirements and skills:\n3-5 years of Solid experience as Python DeveloperExperience with Python frameworks (e.g. Django, Flask, Bottle)Familiarity with Amazon Web Services (AWS) and REST APIUnderstanding of databases and SQL, MongoDBKnowledge of JavaScript and the react next's framework is a plus Familiarity with event-driven programming in PythonAble to create database schemes that represent and support business processes Proficient understanding of code versioning tools{{such-as Git,Mercurial-orSVN}}Knowledge of user authentication and authorization between multiple systems, servers,and environmentsKey Skills :  python Django MySQL MongoDB AWS git flask\nInterested candidates Kindly share the resume:\nContact No. hidden_mobile\nEmail: hidden_emailOther Details DepartmentIT Operations / EDP / MISIndustry IT IT - Software",
    "": ""
  },
  {
    "jobTitle": "Python AWS Developer",
    "jobDescription": "Job DetailsResponsibilities:\n\nWriting reusable, testable, and efficient code.\nDesign and implementation of low-latency, high-availability, and performant applications.\nIntegration of user-facing elements developed by front-end developers with server-side logic.\nImplementation of security and data protection.\nHighly customer focused, accountable, responsive, and collaborative.\nStrong analytical and troubleshooting skills.\n\nEligibility:\n\nMust have 5+ years of experience in Python, and AWS Lambda.\nExperience with AWS cloud (ECS, EC2, VPC, ALB, S3, and other services).\nExperience in any one of the high-level programming languages such as (python, Java, and C++).\nExperience with containerization technologies like Docker, and Kubernetes is good.\nExperience with CDK / Terraform and configuration management systems.\nExperience with our technical stack (Python/Django) is a plus.\n\nLocations: Bangalore, Pune, Hyderabad, Mumbai, Nagpur, and Delhi NCR (Currently work from home).Other Details DepartmentGeneral / Other SoftwareIndustry IT IT - Software",
    "": ""
  },
  {
    "jobTitle": "Urgent | Hiring for Python Developer for one of US based client-Pune (WFH)",
    "jobDescription": "Job DetailsGreetings from Spirient Solutions !!\n \nAs we discussed please find the JD you have requested for. & the requirement for one of our client. So kindly check  below JD. & revert back to me.\nResponsibilities:\n- Build new products, services and add features to existing backend\n- Build reusable code and libraries for future use\n- Take complete end to end responsibility of a feature/module\n- Optimize application for maximum speed and scalability\n- Collaborate with other team members and stakeholders\nSkills:\n- 3+ years of engineering experience with a proven track record of building consumer services back-end\n- You're experienced in building backend using RESTful APIs in Python using Flask or Django framework\n- You're experienced in or willing to learn SQL & NoSQL Databases, Elasticsearch\n& Time series databases.\n- Ability to build & envision data model that suits product needs\n- Work closely with front end developers\n- Familiar with database architecture, scalability, performance and tuning.\n- Systematic problem-solving approach, coupled with a strong sense of ownership and drive\n- Experience with cloud infrastructure & services such as AWS (preferred), Google Cloud or MS Azure is a BIG plus.\n- Must have used git/github\n \nQualifications :\n- B.E./B Tech /M.E./ M Tech / MCA degree in Computer or Information Technology engineering.\n Location:Pune WFH\nNotice Period: Immediate to max 1month\n Other Details DepartmentWeb / Mobile TechnologiesEmbedded / System SoftwareIndustry IT IT - Software EducationGraduation",
    "": ""
  },
  {
    "jobTitle": "Python Developer",
    "jobDescription": "Job DetailsPlease find the below mentioned JD:\nLocation - Bangalore\n \nWe would be needing experienced Python candidates at Consultant or AM designation level.\n \nPlease see below the requirement:\n\n5 years of experience in designing and developing of Python and AWS Cloud based IoT/Analytics solution\nShould have solid working knowledge in Python and related libraries\nExperience in Micro-services architecture\nPerforming Serverless Software development using Amazon Lambda/ Azure Functions written in Python via REST or AWS SDK\nStrong experience in designing and developing enterprise cloud-based IoT solutions using Amazon Cloud Computing Services (like Amazon EC2, S3, RDS IAM, SQS, SNS, VPC, EBS, AWS Route 53, Cloud Watch, Cloud etc.,,)\nFamiliarization of Containerized apps is added advantage\nFamiliar with AWS Glue and related tools/technologies\nExperience in Amazon Cloud Watch monitoring\nUnderstanding and experience in developing solutions using WebSockets\nProficient in RDS concepts including schema design, querying, performance tuning and debugging (preferably in PostgreSQL)\nWell versed with various tools(Jira, Github etc.,)\nShould have excellent problem-solving skills with good communication, logical and analytical skills\nPreferable to candidates who are certified in AWS Cloud Developer Associate\n\n Other Details DepartmentApplication Programming / MaintenanceIndustry IT IT - Software",
    "": ""
  },
  {
    "jobTitle": "Lead Data Engineer - Python",
    "jobDescription": "Job DetailsData Engineers Python/ PySpark\n \n \n \nPrincipal responsibilities\n \n\nRequirement analysis, technical solution options\nDesign prototyping and PoC for each solution.\nBuild data engineering teams to build Group Platform\nFully accountable for reporting of progress, issues, dependencies, and risks of all technical topics to reporting manager\nWork closely with the product manager(s) of Data Platform(s) to provide a holistic end to end solution for Data & Analytics teams.\nDeep hands-on knowledge of various analytical tools like Python, PySpark, Scala and can build data pipeline independently\nAPI and REST API knowledge would be added advantage\nExcellent communication and interpersonal skills.\nExcellent problem-solving skills.\nStrong team player, and able to lead and mentor junior members\n\n Other Details DepartmentWeb / Mobile TechnologiesIndustry IT IT - Software",
    "": ""
  },
  {
    "jobTitle": "Python Trainer and Developer",
    "jobDescription": "Job DetailsWe are looking for experienced python developer and trainer who has experience in python full stack along with django framework knowledge.Other Details DepartmentTechnical / Process TrainingIndustry IT IT - Software",
    "": ""
  },
  {
    "jobTitle": "Lead Data Engineer - Python",
    "jobDescription": "Job Details \n \n\n\nPrincipal responsibilities\n \n\n\n \n\n\nRequirement analysis, technical solution options\n \n\n\n\n\nDesign proto typing and POC for each solution.\n \n\n\n\n\nBuild data engineering teams to build Group Platform\n \n\n\n\n\nFully accountable for reporting of progress, issues, dependencies ,and risks of all technical topics to reporting manager\n\n\n \n\n\n\n\nWork closely with the product manager(s) of Data Platform(s) to provide a holistic end to end solution for Data & Analytics teams.\n \n\n\n \n\n\n\n\nDeep hands-on knowledge of various analytical tools like Python, PySpark, Scala and can build data pipeline independently\n\n\n \n\n\n\n\nAPI and RESTAPI knowledge would be added advantage.\n \nExcellent communication and interpersonal skills.\n\n\n\n\n \n\n\n\n\nExcellent problem-solving skills.\n \n\n\n\n\nStrong team player, and able to lead and mentor junior members\n \n\nOther Details DepartmentWeb / Mobile TechnologiesIndustry IT IT - Software",
    "": ""
  },
  {
    "jobTitle": "apply now for the post of Senior Python Developer",
    "jobDescription": "Job DetailsJob Description Python3 - From dev POV, so can help team write proper Python3 code using FastAPI (or other OpenAPI compliant) (not just scripts) and help in review. - From cloud proficiency level; how to connect and manipulate cloud resources using SDKs (aws-sdk, boto3, etc).\nWorking AWS Cloud knowledge - To work with AWS cloud resources and understand how things are setup. General understanding of DevOps, GitOps, DevSecOps, automation, pipelines, etc - Good to have this skillset. - Jenkins shared library/ GitHub Actions. - Various DevOps tools in various stages.\nThis position is for Pune location with Tavisca, a cxloyalty Technology Platform (Division of JP Morgan Chase & Co.),Other Details DepartmentWeb / Mobile TechnologiesIndustry IT Banking / Financial Services EducationGraduation",
    "": ""
  },
  {
    "jobTitle": "Machine Learning Engineer _BANGALORE",
    "jobDescription": "Job DetailsRequired Technical and Professional Expertise\n\n6 to 8 Years of experience\nML OPS with Data science/ key words:- ML algorithum implementation, python, R programming , data structure, data modelling, software architechture\nlearning oriented programming languages/platforms and Data Visualization tools\nExperience or understanding of end-to-end software tool/solution development and life cycle management\nPrior experience of having worked in consulting/product/analytics environment.\nExperience in Data Science/Analytics with demonstrated track of generating value through DS/ML/AI solutions.\nShould have full understanding of applications of DS/ML/AI solutions to various business problems\nProficiency in using databases like Teradata, NoSQL and Hadoop using SQL, Hive, Spark.\nOther Details DepartmentEngineering Design / ConstructionIndustry IT IT - Software EducationGraduation",
    "": ""
  },
  {
    "jobTitle": "Senior Data Engineer",
    "jobDescription": "Job Details\nMust have experience in Bigdata and Snowflake\nMust have worked on Snowflake data migration form on prem to cloud or from any other traditional dbs , Scalability, Data Storage Formats, concurrency requests, streaming data ingestion.\nAbility to build quick Proof of concept as per the requirements.\nAnalysis on large amounts of historical data, determining suitability for Data Lake, Delta Lake setup, data clean-up, data management and filtering, loading into Snowflake.\nConducting experiments with different types of data models, analyzing performance, to identify the best ways to employ.\nExpertise in Snowflake advanced concepts like setting up resource monitors, RBAC controls, virtual warehouse sizing, query performance tuning, zero copy clone, time travel and understand how to use these features.\nStrong Proficiency in RDBMS, complex SQL, PL/SQL, Python, performance tuning\nExpertise in Snowflake concepts like setting up resource monitors, RBAC controls, virtual warehouse sizing, query performance tuning, zero copy clone, time travel and understand how to use these features\nOther Details DepartmentEmbedded / System SoftwareGeneral / Other SoftwareIndustry IT IT - Software\"jobTitle",
    "": "jobDescription"
  },
  {
    "jobTitle": "EM Strategist",
    "jobDescription": "Job Detailsset up, maintain and build databases set up, maintain and build chart libraries  maintain, create, analyze and interpret macro and financial econometric models track macro-economic and financial data and their impact on global markets.  provide end to end support for publications work under the guidance of senior members of the team based out of different locations\n\nYour team\nYou ll be working in Hyderabad, India, and collaborating with strategists in the Global Strategy team based in London, New York, Singapore, HK and Sydney. The team s purview is as broad as it can be in financial markets both global and across all asset classes. As such it represents one of the best learning opportunities available in finance.\n\n\n\n, excellent Microsoft excel skills 2-3 years of work experience in econometrics/statistical analysis coding experience in Python preferred. Experience in R, Eviews or Matlab also counts.  academic background in quantitative finance/financial engineering preferred working knowledge of market data platforms e.g. Bloomberg, Datastream, Macrobond, Factset, Haver strong understanding of economics, market fundamentals and its driversYou have: excellent attention to detail willingness to collaborate and work in a team ability to take ownership of the projects flexible approach on working hours and work timings clear communication an interest in financial markets, particularly equities, currencies and bond marketsOther Details DepartmentGeneral / Other SoftwareManagement Consulting / StrategyIndustry IT Banking / Financial Services EducationGraduation",
    "": ""
  },
  {
    "jobTitle": "It Trainee",
    "jobDescription": "Job DetailsTraining Opportunity for IT/Non-IT Freshers:\nAbout Company-Accoet India provides high quality IT & Non-IT training courses. To help you achieve better recognition in this competitive world.We provide Training,Development& Placement Program for IT & Non-IT Students. Courses Details:Java Fullstack DevelopmentLaravel Fullstack DevelopmentReact JsDigital MarketingPythonReact NativeAutoCad,Etc.Perks & Benefits:100% Placement Assurance(After Course Completion)Certificate with Project LetterWill Gain Experience with Live Projects.Interested students can contact me or send me your cv on hidden_mobileCourse Duration-3-6 months Contact- hidden_mobile Email Address- hidden_email Office Address-Accoet India,3rd Floor, Bhavani Complex,Near Metro Noida Sec-18 201304Other Details DepartmentGeneral / Other SoftwareIT Operations / EDP / MISIndustry IT IT - Software",
    "": ""
  },
  {
    "jobTitle": "Urgent | who wants Training for software developer",
    "jobDescription": "Job DetailsAccoet India Now offer to choose 100% Training & Placement drive with our reputed clients-(HCL, Genpact, Wipro, Motherson.Etc\nRequired Positions Java (Full Stack Developer) Python (Developer) Frontend Developer React developer\nSEATS AVAILABLE 32TRAINING ENROLLMENT DATE 10 November to 15 NovemberTRAINING DURATION-90 Days\nPROCESS TO ENROLL Online/Offline\nHOW TO JOIN CONTACT TO OUR COUNSELLOR (hidden_mobile)\nFor more info whats app me on the same number \nCompany Credibility Accoet provides high quality IT training courses. Training is an important step in advancing your career and attainingprofessional goals.So, To help you make your career ready with corporate requirements we will be nurturing you throughout.We are availablein physical as well as virtual mode. Our team is comprised of learning professional, subject matter and ITprofessionals.Launched in 2013, Accoet is a sub-brand of Spirale HR Solution Private Limited. At Accoet we provides wide rangeof IT training to boost up your career. Varieties include Fullstack, Frontend, Backend, Laravel, Java, React, Flutter,PHP, Networking, Digital Marketing, Web designing, Mobile Applications Development (IOS, Android) etc. To helpyou achieve better recognition in this competitive world.\nAt (Venue):\nAccoetIndia\n3rdFloor,Bhawani Complex,Noida Sector 18,Atta Market,\nPocket E,Sector 27,Noida(201304).\n[Landmark:- Nearby Sector 18 Metro Station]\n \nThanks And Regard'sHR TeamAccoet IndiaOther Details DepartmentTechnical / Process TrainingIndustry IT IT - Software",
    "": ""
  },
  {
    "jobTitle": "Research Analyst",
    "jobDescription": "Job DetailsWe are seeking intellectual, adaptable and quick-learning analysts to collaborate with for data-based projects. The projects will involve generation, processing, testing, and analysis of data.\n \nWhat type of data \n\nQualitative (text) and quantitative (numeric)\nObtained from open source websites/ paid databases/ surveys/ financial statements\nRelated to consumers/ government/ companies/ in various sectors and departments\nStructured and unstructured\n\n \nWhat type of testing \n\nIn most cases, you will be required to extract the data (from public/ private sources) or generate it from scratch\nProcess the data by treating the outliers, missing values, organising/ splitting/ combining and labeling variables, even out the observations, arranging them in the correct order.\nYou have to judge which test to apply- regression  sentiment analysis  CFA  frequency distribution \nLastly, apply that test in a suitable application. We use Python, R, SPSS, STATA, and EViews. You're welcome to experiment with any other.\n\n \nWhat type of analysis \n\nAfter running the test, draw from its findings- what do the figures mean  why  what are its implications for the concerned party \nIf it involves predictive analysis, how should the party plan the next move  Suggest!\nWrite a report including summaries of text, figures and tables.\nCompare primary and secondary data findings to arrive at a conclusion.\n\n \nWhat skills must you have \n \n\nData analysis in R/ Python/ SPSS/ Tableau/ SAS or similar\nImpeccable English (spoken & written)\nCritical thinking (the ability to question reality and think of possible outcomes)\n\n \nWhat else do we need \nApart from the skills, you must have:\n\nEagerness to learn new skills\nOpenness to newer types of projects\nCuriosity to work in a fully remote environment\nWillingness to experiment with data\n\n \nQualifications\n\nMaster's degree in Economics or Statistics\nExpertise with any one software mentioned above\nPrevious quantitative and qualitative research experience\nOther Details DepartmentStatistics / AnalyticsIndustry IT Education / Training",
    "": ""
  },
  {
    "jobTitle": "Lead Software Engineer",
    "jobDescription": "Job Details\nDevelops moderately complex code using both front and/or back end programming languages within multiple platforms as needed in collaboration with business and technology teams for internal and external client software solutions. Designs, creates, and delivers moderately complex program specifications for code development and support on multiple projects/issues with a wide understanding of the application / database to better align interactions and technologies.\nProvides broad and in-depth knowledge of analysis, modification, and development of complex code/unit testing in order to develop concise application documentation. Performs and advises on testing, validation requirements, and corrective measures for complex code deficiencies and provides systemic proposals.\nParticipates in client facing meetings, joint venture discussions, vendor partnership teams to determine solution approaches.\nProvides advise to leadership on the design, development and enforcement of business / infrastructure application standards to include associated controls, procedures and monitoring to ensure compliance and accuracy of data. Applies a full understanding and in-depth knowledge of procedures, methodology and application standards to include Payment Card Industry (PCI) security compliance.\nDevelops, administers and recommends billable hours and resource estimates on complex initiatives, projects, and issues.\nAssists with on-the-job training and provides in-depth expertise and advice to software engineers.\nWhat Are We Looking For in This Role \nMinimum Qualifications\nBS in Computer Science, Information Technology, Business / Management Information Systems or related field\nTypically minimum of 6 years - Professional Experience In Coding, Designing, Developing And Analyzing Data. Typically has an advanced knowledge and use of two or more opposing front / back end languages / technologies from the following but not limited to; two or more modern programming languages used in the enterprise, experience working with various APIs, external Services, experience with both relational and NoSQL Databases\nPreferred Qualifications\nBS in Computer Science, Information Technology, Business / Management Information Systems or related field\n8+ years professional Experience In Coding, Designing, Developing And Analyzing Data and experience with IBM Rational Tools\nWhat Are Our Desired Skills and Capabilities \nSkills / Knowledge - Having wide-ranging experience, uses professional concepts and company objectives to resolve complex issues in creative and effective ways. Some barriers to entry exist at this level (e.g., dept./peer review).\nJob Complexity - Works on complex issues where analysis of situations or data requires an in-depth evaluation of variable factors. Exercises judgment in selecting methods, techniques and evaluation criteria for obtaining results. Networks with key contacts outside own area of expertise.\nSupervision - Determines methods and procedures on new assignments and may coordinate activities of other personnel (Team Lead).\nOperating Systems:\n\nLinux distributions including one or more for the following: Ubuntu, CentOS/RHEL, Amazon Linux\nMicrosoft Windows\nz/OS\nTandem/HP-Nonstop\nDatabase - Design, familiarity with DDL and DML for one or more of the following databases Oracle, MySQL, MS SQL Server, IMS, DB2, Hadoop\nBack-end technologies - Java, Python, .NET, Ruby, Mainframe COBOL, Mainframe Assembler\nFront-end technologies - HTML, JavaScript, jQuery, CICS\nWeb Frameworks  Web technologies like Node.js, React.js, Angular, Redux\nDevelopment Tools - Eclipse, Visual Studio, Webpack, Babel, Gulp\nMobile Development  iOS, Android\nMachine Learning  Python, R, Matlab, Tensorflow, DMTK,Other Details DepartmentGeneral / Other SoftwareIndustry IT Banking / Financial Services EducationGraduation",
    "": ""
  },
  {
    "jobTitle": "Data Engineer (L 08)",
    "jobDescription": "Job DetailsWe are looking for a Data Engineer to be part of our Data & Analytics Agile teams and perform functional & system development for Abinitio applications across Enterprise Data initiatives. This is high visibility fast paced key initiative and will integrate data across internal and external sources, provide analytical insights and integrate with our critical systems. This individual will work with development teams utilizing modern software development methodologies and tools to provide best solution for Synchrony.\n\nThis position is remote, where you have the option to work from home. On occasion we may request for you to commute to our nearest office for in person engagement activities such as team meetings, training and culture events. To ensure the safety of our colleagues and communities, we require employees who come together in-person to be fully vaccinated. Were proud to offer you choice and flexibility.\n\nEssential Responsibilities:\n\nParticipate in the agile development process\nGovern design strategy, production promotion processes, software change control specifically related to Ab Initio as well as DW technology.\nParticipate in code review process\nWork with team members to achieve business results in a fast paced and quickly changing environment\nEnsure preparation and maintenance of appropriate technical documentation including but not limited to program design document, process flows and test plan.\nParticipate in addressing IRs/RCAs with Service Delivery team and provide direction in problem resolution\nPerform other duties and/or projects as assigned\nQualifications/Requirements:\n\nBachelor's degree in a quantitative field (such as Engineering, Computer Science, Statistics, Econometrics) with a minimum of 2 years of experience; OR in lieu of a degree, 4 years of experience.\nGood understanding of Database and Datawarehouse concepts\nHands-on exposure in the following Ab Initio tools: GDE  Graphical Development Environment; Co>Operating System\nHands-on experience in writing shell scripts, complex SQL queries\nAbility to write abstracted, reusable code components\nFor Internal Applicants: Understand the criteria or mandatory skills required for the role, before applying.\nInform your Manager or HRM before applying for any role on Workday.\nEnsure that your Professional Profile is updated (fields such as Education, Prior experience, Other skills) and it is mandatory to upload your updated resume (Word or PDF format)\nMust not be any corrective action plan (First Formal/Final Formal, PIP)\nEmployees who have completed 18 months in the organization and 12 months in current role and level are only eligible\nExisting Level 5, 6 & 7 are eligible to apply, will be considered for Level 8 if selected\nDesired Characteristics:\n\nPreferred exposure to the following Ab Initio tools: Control Center; Metadata Hub; Enterprise Meta>Environment; Enterprise Meta>Environment Portal; Acquire>It; Express>It; Conduct>It; Data Quality Environment; Query>It; Test Data Management.\nAnalytical mindset\nPerformance tuning experience\nExperience in developing Hive, Sqoop, Spark, HBase on Hadoop\nFamiliar with Ab Intio, Hortonworks, Zookeeper, Oozie, and Kafka is a plus\nProgramming experience in at least one of the following languages: Scala, Java or Python\nWillingness to learn new technologies quickly\nSuperior oral, and written communication skills, as well as the willingness to collaborate across teams of internal and external technical staff, business analysts, software support and operations staff.\nStrong business acumen including a broad understanding of Synchrony Financial business processes and practices\nDemonstrated ability to work effectively in a team environment\n,Other Details DepartmentGeneral / Other SoftwareIndustry IT Banking / Financial Services EducationGraduation",
    "": ""
  },
  {
    "jobTitle": "Python Backend Developer",
    "jobDescription": "Job DetailsWe are looking for a Senior Python Developer 5 + Years of Experience for our esteemed client for Bangalore / Chennai Locations.\nRoles and Responsibilities\n\nTo provide effective Designing, implementing, and maintaining Python applications.\nDelivering high availability and performance\nContributing in all phases of the development lifecycle\nWriting well-designed, efficient, and testable code using Python\nConducting software analysis, programming, testing, and debugging\nManaging Web application development using Python\nEnsuring designs comply with specifications\nTransforming requirements Into stipulations\nWork independently with very minimal supervision\nWork closely with architects during all phases of the development lifecycle\n\n \nRequirements\nQualification, Required skills\n\nWe are looking for candidates with a minimum of 5 years of Software Development\nMandatory - Excellent knowledge in Core Python, Python Coding, Python Frameworks\nExperience in c is preferred\nExperience in Web application development using Python\nKnowledge on Python Based ERP Development is preferred\nBachelors in degree in B.E/B.Tech is consider\n\n \n Other Details DepartmentApplication Programming / MaintenanceIndustry IT IT - Software",
    "": ""
  },
  {
    "jobTitle": "Manager, Clinical Data Scientist, Clinical Data Sciences",
    "jobDescription": "Job DetailsAs a Manager, you provide guidance to operational teams for managing projects. Your planning skills will help in preparing forecasts for resource requirements, and providing areas of improvement for products, processes or services. Through your comprehensive knowledge of principles, concepts and theories of the discipline, you will also work towards advancing new concepts and methodologies. You will be able to take a leadership role to facilitate agreements between different teams.\n\nIt is your dedication and focus that will help make Pfizer ready to achieve new milestones and help patients across the globe.\n\nHow You Will Achieve It\nProvide guidance, lead/co-lead projects, manage own time to meet objectives, plan resource requirements for projects across the division.\nEnsure work carried out by providers is in accordance with applicable Standard Operating Procedures (SOPs) and working practices.\nPromote the use of consistent, efficient, and quality processes to meet timelines and deliverables.\nServe as Clinical Data Scientist and Trial Lead for one or more clinical trials assuming responsibility for all Data Monitoring and Management (DMM) activities and interact with Clinical Data Scientist at study level for deliverables.\nServe as a technical resource to the study teams for data visualization and reporting tools and provide technical expertise and business process support in technology systems.\nEnsure operational excellence in collaboration with partners for application of standards, data acquisition, proactive data review and data integrity and overall data management activities.\nPartner with Research/Business Units and any external DM service provider to deliver high quality data management for all studies as assigned.\nPerform central monitoring activities including review system outputs, propose suggestions for signal and action management, and follow up with study team for the action resolutions.\nPlan and execute communication plans and methods for engaging customer populations.\nQualifications\nMust-Have\nBachelor's Degree\n5+ years experience\nExperience within the pharmaceutical industry or in a health information management role\nWorking knowledge of all phases of clinical trials and ability to assess and determine study requirement from protocol review\nWorking knowledge of clinical research, Food and Drug Administration & International Conference on Harmonization Good Clinical Practices (GCDMP), and related regulatory requirements\nStrong Project and Risk Management\nStrong verbal and written communication skills, demonstrated ability to handle multiple tasks and projects\nKnowledge of Windows Environment and its applications.\nNice-to-Have\nMaster's degree\nContract Research Organization {CRO} and vendor oversight experience\nProficient in using commercial clinical data management systems and/or EDC products,Other Details DepartmentGeneral / Other SoftwareIndustry IT Pharma / Biotech EducationGraduation",
    "": ""
  },
  {
    "jobTitle": "Data Engineer",
    "jobDescription": "Job Details*\n Role Responsibilities \n\n\nResponsible for the end-to-end deliveries of the technology portfolio comprising key business product areas such as CCIB Cash Analytics initiatives. Implement framework, automate delivery pipeline build new capabilities within data space. Own technology delivery of projects across global SCB markets that includes\n\nAbility to design and develop applications with strong focus on performance and security for the application.\nDesign and build technical framework for new applications and changes to existing applications.\nBuild technical framework.\nEngineer the dev ops pipe.\nAble to drive design and implement modern design patterns.\nIntroduce new technologies of ML / AI on existing or new data platform.\nSupport operational improvements, process efficiencies and zero touch agenda.\nBuild Cash data platform to align with latest technology and architecture trends, improved stability and scale.\n\n\nDefine, document, and communicate it.\nParticipate in design/requirements to evaluate impact and effort estimate.\nManage to deliver quality output through tools and with reduced effort.\nMake sure the software and system architectures are in synchronization.\nMake sure the right modeling is being done, to know that qualities like performance are going to be met.\nPlan for new technology insertion.\nManage risk identification and risk mitigation strategies associated with the architecture.\nEnsure JIRA / Agile Development process compliance.\n\n Regulatory and Business Conduct \n\nDisplay exemplary conduct and live by the Group s Values and Code of Conduct.\nTake personal responsibility for embedding the highest standards of ethics, including regulatory and business conduct, across Standard Chartered Bank. This includes understanding and ensuring compliance with, in letter and spirit, all applicable laws, regulations, guidelines and the Group Code of Conduct.\nLead to achieve the outcomes set out in the Bank s Conduct Principles: [Fair Outcomes for Clients; Effective Financial Markets; Financial Crime Compliance; The Right Environment.] * \nEffectively and collaboratively identify, escalate, mitigate and resolve risk, conduct and compliance matters.\nExercise authorities delegated by the Board of Directors and act in accordance with Articles of Association.\n\n Our Ideal Candidate \n\nDatabase Oracle, SQL server, PL / SQL\nPython\nHadoop\nHDFS / Hive\nLinux / Unix\nSpark\nDatawarehouse\nJava, API, Microservice\nKafka\nTableau / PowerBI\nDevOps\nDataiku\nAI / ML\n\n\n About Standard Chartered \nWere an international bank, nimble enough to act, big enough for impact. For more than 160 years, weve worked to make a positive difference for our clients, communities, and each other. We question the status quo, love a challenge and enjoy finding new opportunities to grow and do better than before. If youre looking for a career with purpose and you want to work for a bank making a difference, we want to hear from you. You can count on us to celebrate your unique talents. And we cant wait to see the talents you can bring us. Our purpose, to drive commerce and prosperity through our unique diversity, together with our brand promise, to be here for good are achieved by how we each live our valued behaviours. When you work with us, youll see how we value difference and advocate inclusion. Together we:\n\n Do the right thing and are assertive, challenge one another, and live with integrity, while putting the client at the heart of what we do\n Never settle, continuously striving to improve and innovate, keeping things simple and learning from doing well, and not so well\n Be better together, we can be ourselves, be inclusive, see more good in others, and work collectively to build for the long term\n\n In line with our Fair Pay Charter, we offer a competitive salary and benefits to support your mental, physical, financial and social wellbeing.\n\n Core bank funding for retirement savings, medical and life insurance, with flexible and voluntary benefits available in some locations\n Time-off including annual, parental/maternity (20 weeks), sabbatical (12 weeks maximum) and volunteering leave (3 days), along with with minimum global standards for annual and public holiday, which is combined to 30 days minimum\n Flexible working options based around home and office locations, with flexible working patterns\n Proactive wellbeing support through Unmind, a market-leading digital wellbeing platform, development courses for resilience and other human skills, global Employee Assistance Programme, sick leave, mental health first-aiders and all sorts of self-help toolkits\n A continuous learning culture to support your growth, with opportunities to reskill and upskill and access to physical, virtual and digital learning\n Being part of an inclusive and values driven organisation, one that embraces and celebrates our unique diversity, across our teams, business functions and geographies - everyone feels respected and can realise their full potential.\n\n Recruitment assessments - some of our roles use assessments to help us understand how suitable you are for the role youve applied to. If you are invited to take an assessment, this is great news. It means your application has progressed to an important stage of our recruitment process.\n\nVisit our careers website www.sc.com/careers \n,Other Details DepartmentGeneral / Other SoftwareIndustry IT Banking / Financial Services EducationGraduation",
    "": ""
  },
  {
    "jobTitle": "Data Engineer/Sr. Data Engineer",
    "jobDescription": "Job DetailsThis position requires someone to work on complex technical projects and closely work with peers in an innovative and fast-paced environment. For this role, we require someone with a strong product design sense & specialized in Hadoop and Spark technologies.\n Requirements: \nMinimum 3-6 years of experience in Big Data technologies.\nThe position Grow our analytics capabilities with faster, more reliable tools, handling petabytes of data every day.\nBrainstorm and create new platforms that can help in our quest to make available to cluster users in all shapes and forms, with low latency and horizontal scalability. Make changes to our diagnosing any problems across the entire technical stack. Design and develop a real-time events pipeline for Data ingestion for real-time dash- boarding.\nDevelop complex and efficient functions to transform raw data sources into powerful, reliable components of our data lake.\nDesign & implement new components and various emerging technologies in Hadoop Eco- System, and successful execution of various projects.\nBe a brand ambassador for Paytm Stay Hungry, Stay Humble, Stay Relevant!\n Preferred Qualification  :\nBachelor's/Master's Degree in Computer Science or equivalent.\n Skills that will help you succeed in this role: \nFluent with Strong hands-on experience with Hadoop, MapReduce, Hive, Spark, PySpark etc.\nExcellent programming/debugging skills in Python/Java/Scala.\nExperience with any scripting language such as Python, Bash etc.\nGood to have experience of working with noSQL databases like Hbase, Cassandra.\nHands-on programming experience with multithreaded applications.\nGood to have experience in Database, SQL, messaging queues like Kafka.\nGood to have experience in developing streaming applications e.g. Spark Streaming, Flink, Storm, etc.\nGood to have experience with AWS and cloud technologies such as S3Experience with caching architectures like Redis etc.\n \n,Other Details DepartmentGeneral / Other SoftwareIndustry IT IT - Software EducationGraduation\"jobTitle",
    "": "jobDescription"
  },
  {
    "jobTitle": "Backend Developer  Node.js",
    "jobDescription": "Job DetailsJob Brief We are looking for a rockstar JavaScript developer who is proficient with either of theJavaScript Frameworks. You will ensure that these components and the overall application are robust andeasy to maintain. You will coordinate with the rest of the team working on differentlayers of the infrastructure. Therefore, a commitment to collaborative problemsolving, sophisticated design, and quality products are important.Technical Skills: Minimum 2+ years of hands-on software engineering experience in Node.js andTypescript (Including Express, Feathers.js or similar) Good knowledge of SQL databases like (MySQL, MSSQL, ORACLE). Must be a self-starter who can work well with minimal guidance and in fluidenvironment\nSoft Skills: Obsessed with best practices and have an eye for detail. Self starter with a high level of drive and commitment. High energy and drive to work in a product base environment. Conceptual thinking, flexibility and ability to juggle with multiple responsibilities. Hands-on and detail oriented.\nBonus if you have the following: Advanced Javascript framework: ReactJS, AngularJS, BackboneJS. Familiarity with common Javascript Libraries such as jQuery would be a plus. Good understanding of AJAX and its UI implications. Active contributor to developer communities like Stackoverflow, Topcoder, Github etc.Other Details DepartmentIT Operations / EDP / MISIndustry IT IT - Software",
    "": ""
  },
  {
    "jobTitle": "Full Stack Developer - Nest + Node(Backend) & Next + React(Frontend)",
    "jobDescription": "Job Details\n\n\nAbout the job\nJob description -\nFull stackDeveloper:\nNest + Node is needed (that is the backend). experience with the front end (ie Next + React) can be lower or not there. Some other front end experience is also fine.\n\n3-5 years of experience in ReactJS\nAround 2 years of experience in NextJs\nShould have strong knowledge of NextJs and ReactJs\nDeep understanding of JavaScript and Typescript\nShould have hands-on experience in Server-side rendering with NextJs.\n3-5 years of experience in NodeJs\nAt least 1-year experience in working with PostgreSQL\nShould have sound knowledge of docker\nShould have experience working with microservices.\nShould have experience with NestJs\nNice to have experience with NATS and Kubernetes.\n\n\n\nOther Details DepartmentGeneral / Other SoftwareIndustry IT IT - Software",
    "": ""
  },
  {
    "jobTitle": "Full stack Developer-(React js/Node js/Angular )",
    "jobDescription": "Job DetailsDesignation : Full stack Developer-(React js/Node js/Angular )\nExperience: 2 to 7 Years\nEducation: B.E/B.Tech/MSc/MCA (Preferred). Other qualifications can be considered provided the candidate is highly potential.\nLocation: Trichy\nVacancy: 2\n \nJob Description :\n* To work with a cross-functional software development team on highly visible strategic projects as an expert-level individual contributor to the coding tasks assigned.* Responsible for development of highly responsive, web based UI in a flexible and well-structured frontend architecture.* Experience working with remote data via REST and JSON* Experience with third party libraries and APIs (Google APIs etc. )* Produce well designed efficient code in a timely manner to meet delivery timescales/milestones.* Mentor other developers on software best practices technical guidance and help grow their software development skill sets.* To proactively stay plugged into emerging technologies/industry trends and apply them into operations and activities.* Should demonstrate the ability to handle multiple projects simultaneously, manage priorities and communicate progress effectively.\n \nDesired Candidate profile\n* PRIMARY SKILLS NEEDED: NodeJS, AngularJS, React JS* PHP Laravel and CodeIgniter Frameworks experience.* MySQL and NoSQL DB (like MongoDB/Cassandra) - MUST HAVE.* jQuery, JSON, AJAX, web services/REST, SQL.* JavaScript frameworks like NodeJS, AngularJS, ReactJS, Jasmine or Ember etc., or JS-based build tools like Grunt, Gulp, and Bower.* Working knowledge of Apollo, GraphQL, Moment.js is an advantage.* UX or UI designing experience is an advantage.* Strong Knowledge in Core java\n Other Details DepartmentGeneral / Other SoftwareIndustry IT Recruitment Services",
    "": ""
  },
  {
    "jobTitle": "Node JS Developer",
    "jobDescription": "Job DetailsWe are Working with top Companies in the world currently we are Looking for below profile. \nPost: Node JS Developer \nExperience: 2 Years +\nLocation : Ahmedabad (Work From Home)\n \nRequired Qualifications:At least 2 Years of Information Technology experience.At least 2 year of experience in Web application using Backend TechnologiesMinimum 2 year using Node.js, Javascript, Rest API, MySQL or PostgreSqlHands on experience in development using NodeJs, ExpressPreferred Qualification :Good understanding of Integration with REST services, Microservices, JSON structuresGood experience in Unit Testing principles and toolsCompetent in Agile execution ProcessShould have good Analytical and communication skillsEnsure compliance to processes set by clientsAbility to work in a collaborative multi-application team environment.Experience and desire to work in a Global delivery environment\n \nIntrasted candidates send me resume on hidden_email or call me on 88-66-8000-40.Other Details DepartmentERP / CRMApplication Programming / MaintenanceIndustry IT IT - Software EducationGraduation",
    "": ""
  },
  {
    "jobTitle": "Node Developer",
    "jobDescription": "Job Details\n\n\n\n\n\nAbout the job\n \nWe are looking for a Node JS developer responsible for managing the interchange of data between the server and the users. Candidates' primary focus will be the development of all server-side logic, definition, and maintenance of the central database and ensuring high performance and responsiveness to requests from the front end. They will also be responsible for integrating the front-end elements built by your co-workers into the application. Therefore, a basic understanding of front-end technologies is necessary as well.\nLocation: Bangalore\nReporting Manager: VP, Engineering\n \nJob Description:\nIntegration of user-facing elements developed by front-end developers with server-side logic.\nWriting reusable, testable, and efficient code.\nDesign and implementation of low-latency, high-availability, and performant applications.\nImplementation of security and data protection.\nIntegration of data storage solution (may include database, key-value stores, blob stores, etc).\nArchitect technical solutions and write high-quality JavaScript to create an exceptional user experience.\nTroubleshoot and fix front-end issues, find and address performance issues.\n \nKey Skills:\nStrong proficiency with JavaScript (ES6/ECMAScript 2015) and modern JavaScript libraries like jQuery, Lodash, etc.\nKnowledge of Node.js and frameworks available for it (such as express, nest).\nFamiliarity with Progressive Web Applications and Single Page Applications and frameworks (Vue, React, Angular with Typescript, etc).\nHand on and implements complex Angular applications, directives, pipes, interceptor, services, etc.\nExperience with reactive programming and composing Observables using RxJS or other Reactive programming techniques/libraries.\nNode-based module loaders and task runners (Webpack, Gulp, or Grunt), creating npm modules.\nUnderstanding the nature of asynchronous programming and its quirks and workarounds.\nGood understanding of server-side templating languages (such as jade, EJS, and pug).\nCreating database schemas that represent and support business processes.\nImplementing automated testing platforms and unit tests.\nProficient understating of code versioning tools, such as GIT.\nBasic understanding of front-end technologies, such as HTML5, SCSS, and CSS3.\nAbility to make recommendations on UI design and UX best practices.\n \n\nDesired Skills and Experience\nNode.js,ES6,JavaScript Libraries,JavaScript Frameworks\n \n\n\n\n\nOther Details DepartmentGeneral / Other SoftwareIndustry IT IT - Software",
    "": ""
  },
  {
    "jobTitle": "Node js Developer",
    "jobDescription": "Job DetailsDear Candidates,\n \nJob description\nWe are urgently looking for a Node.js Developer having more than 3 years of experience. Thedesired candidate must have 2 to 3 years of total experience with good expertise in MEANStack (MongoDB, ExpressJS, AngularJS and Node.js) and JavaScript. The candidate musthave strong development and coding skills, good analytical and problem solving skills.Roles/ responsibilities:1) Coding and Development. The desired candidate will be responsible for developing nextgeneration gaming application/software.2) Analyzing requirements, problems and solving them with the best solution.3) Producing high quality code without much supervision and on-time delivery.4) Working in cross-functional team, collaborating with peers during entire SDLC.5) Defining code architecture decisions to support a high-performance and scalableproduct.Mandatory skills:1) Knowledge and Experience with NodeJS, AngularJS/React JS/React Native/Express JSand Mongo DB.2) Working Experience on Socket.io library.3) Good understanding and experience on popular relational and non-relational databaseslike MySQL, MongoDB.4) Experience with Git.5) Good knowledge of Data Structures and algorithms.Other Details DepartmentGeneral / Other SoftwareIndustry IT IT - Software",
    "": ""
  },
  {
    "jobTitle": "urgent hiring Business analyst.bidding react js,node js ,react native,php 0 to 5",
    "jobDescription": "Job DetailsDear Candidates,\nGreeting of the day!\nWe are  hiring  candidate:-\nFreshers /Exp BOTH candidates can apply for this\nSOFTWARE DEVELOPERS / WEB DEVELOPERS / WEB designing / SEO digital marketing \njava developer  1 to 6  year experience  salary   5 to 10.5 lpa  5 opening \n{hibernate ,spring ,boots, java scripts  interface desi, to create engaging user exp \n \nReact native developer  3 to 5 exp  -4 opening               [   experience salary - 5 to 10 .5 lpa ]\n                                                                                                   2 to 7 exp \nla-revel developer -exp 2 to 4 year   and freshers                          \nmegento developer 1 to 3 year Exp  \nflutter developer 2 to 5 EXP \nANDROID DEVELOPERS/ flutter /exp 2 to 4 exp and one freshers \nReact js and Node js exp  2 to 4 year and one freshers \nJAVA DEVELOPERS freshers \nIOS DEVELOPERS  exp 1 to 2 year one fresher -00\nPHP / WEB DESIGNING GRAPHICS  2 to 4 year  exp 2 freshers \n hidden_email\n \nNote - We don't charge any registration fees:-\nINTERVIEW'S GOING ON:- URGENT OPENING \nInterview - 10am to 5pmTiming\nJob Location - NOIDA / delhi \nif you want to take more information please cont. on the below number.\ncont - hidden_mobile                         \ncont person - Mr. SINGH /mis NEHA / MR SADAB\nTime of Interview - 10 AM - 4 PM\nJoining - Immediate\nNote : Candidate have to carry following Documents while coming for the interview\n1) 2 Passport Size Photograph\n2) Updated Resume\n3) Original DocumentsOther Details DepartmentWeb DesignWeb / Mobile TechnologiesIndustry IT IT - Software",
    "": ""
  },
  {
    "jobTitle": "JS Node Developer",
    "jobDescription": "Job DetailsResponsibilities:\n\nDevelop highly scalable, multi-tenant applications and services for our Cloud-based solutions.\nBuild features, resolve issues, and test software related to applications and services while working closely with engineers, DevOps, and Product Management.\nDrive architecture, design, code reviews, and documentation of technical features.\nParticipate in the Agile process; clearly communicate project status, progress, and blockers to the rest of the team.\nEnsure feature quality through extensive testing (unit, integration, performance).\nOwn your solutions from development to production.\nMentor other engineers, perform code reviews, and develop standard coding practices.\nIn a fast-paced and collaborative Agile team, study the consumer market and client needs to design innovative software applications.\nApply software engineering principles to the design, development, maintenance, and testing of software solutions.\nWrite code with scalability, maintainability, performance, and integration with other components and systems in mind.\nSupport the products by participating in an on-call rotation.\nComplete required testing and documentation to support product release and regulatory submissions.\nLeverage AWS components to implement technical solutions.\n\n \nRequirements:\n\n2+ years of experience in software development, in developing within a microservice-based architecture, creating serverless Node.js microservices, designing, building, and deploying, serverless enterprise applications and in participating in an Agile working environment.\nStrong back-end experience in Node.js, REST APIs and Object Relational Mapping (ORM).\nHands-on experience with SQL (PostgreSQL) and NoSQL (MongoDB) database technologies.\nExperience with API security and versioning.\nA strong understanding and proven experience with AWS.\nPreferred Experience in Express.js, TypeScript, Docker, and Kubernetes.\nKnowledge of Anguler and its core principles.\nOther Details DepartmentApplication Programming / MaintenanceWeb / Mobile TechnologiesIndustry IT Sports / Fitness EducationGraduation",
    "": ""
  },
  {
    "jobTitle": "Full Stack Developer",
    "jobDescription": "Job DetailsFull Stack Developer\nWe're looking for a Full Stack developer to help our development team write more\nquality codes and learn the nitty grittiest of all things SaaS and iPaaS. You'll have a\ngood exposure to a variety of products, APIs, frameworks shaping you to be a market\nready person.\n \nHow your work will be:\n \n\n\nWriting quality code in a JavaScript & its frameworks and server-side scripts.\nSupporting the development team by investigating and suggesting better\nalternatives.\nUnderstanding of front-end technologies such as JavaScript, HTML5, CSS,\njQuery.\nImplementing unit tests.\nUnderstanding the nature of asynchronous programming, its quirks, and\nworkarounds.\nUnderstanding fundamental design principles behind a scalable application.\nCreating database schemas that represent and support business processes.\n\n\n \nWhat we look for in you:\n \n\n\nBachelor's degree in computer science or IT\n2 - 7 years of prior experience\nProven experience as a Full Stack Developer or similar role\nProficient with JavaScript frameworks such as jQuery, Node, React etc\nEngagement with the work given.\nExcellent communication and teamwork skills.\n\nOther Details DepartmentIT Operations / EDP / MISIndustry IT IT - Software EducationGraduation",
    "": ""
  },
  {
    "jobTitle": "Full Stack Developer",
    "jobDescription": "Job DetailsJob Description: Working in back-end web development with Node.js Working with Angular, RTDD/BDD experienceExperience with server-side templating languagesExperience with Express.js, Loopback, SailsJS, Meteor.js or other frameworks.Experience consuming and building robust, SOAP and RESTful APIsExperience with Relational Databases like MongoDB, MySQLSolid understanding and extensive experience with version control tools like Git, SVN or MercurialExceptional problem solving and ability to work independentlyExceptional learning skillsUnderstanding of Agile methodologiesNice to have:Strong Computer Science fundamentalsExperience building scalable systems with cloud infrastructures like AWS.  Job Responsibilities:Educational Qualifications: Any graduation from technical stream1.Develop and ship highly available and scalable back-end, front-end, and database software components2.Grow and mentor software engineers and work with them to identify, design, prototype, and evaluate great product features Candidate Attributes:Behavioral -1.Excellent communication skills with the ability to present complex technical information in a clear and concise manner to a variety of stakeholders2.Demonstrated collaboration abilities in an engineering environment in driving development excellence and best practices\nTechnical -1.Hands-on and deep experience building applications and expert level proficiency in modern programming languages like JAVA, NodeJS, Python etc, database management with SQL and NoSQL etc, data pipelines with Kafka, RedShift etc, CI/CD development.Other Details DepartmentApplication Programming / MaintenanceIndustry IT IT - Software\"jobTitle",
    "": "jobDescription"
  },
  {
    "jobTitle": "IoT Cloud Architect",
    "jobDescription": "Job Details\n\n\n\n\n\nAbout the job\n \nJob Designation: IoT Cloud Architect\nExperience: 3 to 10 Yrs (start-up experience is a must)\nJob Location: Remote (full-time & permanent)\nWork timings: 5 days working / 40 hrs a week (PST Time-Zone might overlap)\n \nAbout the Organization :\nThe company is an AI as a Service Company. They have their own IoT/AI platform and we provide professional services on that platform to build custom clouds for their IoT devices.\nIt is a network of the world's best developers - full-time, long-term remote software jobs with better compensation and career growth. They enable their clients to accelerate their Cloud Offering, and Capitalize on Cloud. They also build mobile apps, run 24x7 devops/site reliability engineering for our clients.\nThey believe AI should be explainable, can be built on small data, and trained incrementally. Their Team has many years of collective experience in Incremental Learning, Reinforcement Learning, and Self Supervised Learning. We have delivered many solutions based on Computer Vision, Sensor Data, Audio Data, Natural Language Text, and more - in CLOUD as well as in EDGE.\n \nAbout the role :\nYou will be working on AI/IoT cloud and responsible for architecture and ensuring the aspects such as fault tolerance and scalability. You will lead the troubleshooting of the cloud. They need someone who can engage in conversations about detailed technical architecture with an internal team and external customers. You will be responsible for creating architecture documents, explaining design, troubleshooting, reviewing work by others in the team, giving good guidance, and ensuring functional cloud. They are looking for a can do it attitude, and ability to deliver with high velocity and high-quality at the same time.\n \nThey use MQTT, RabbitMQ, Cassandra, MongDB, CloudFlare and backend components (Django) to build APIs. You will be working on our IoT/AI cloud platform and building/architecting/coding as well as leading other technical engineers in a team.\n \nThis person MUST have:\n\n\nPython with Django experience\nBE Computer Science, MCA or equivalent\nCloud app development experience\nStrong Troubleshooting/Debugging experience\nHave used RabbitMQ\nExperience with postgres, MONGO and cassandra- Databases\nStrong communication skills\n\n\n\nBenefits:\n\n\nPF, medical insurance, 12 annual company holidays, 12 PTO leaves per year, annual increments, Diwali bonus, spot bonuses and other incentives etc.\nWe dont believe in locking in people with large notice periods. You will stay here because you love the company. We have only a 15 days notice period.\n\n\n\n \n\nDesired Skills and Experience\npython,Django,Cloud Applications,RabbitMQ,PostgreSQL,Cassandra,MongoDB\n \n\n\n\n\nOther Details DepartmentHRIndustry IT Advertising / MR / PR / Events",
    "": ""
  },
  {
    "jobTitle": "Python AWS Developer",
    "jobDescription": "Job DetailsResponsibilities:\n\nWriting reusable, testable, and efficient code.\nDesign and implementation of low-latency, high-availability, and performant applications.\nIntegration of user-facing elements developed by front-end developers with server-side logic.\nImplementation of security and data protection.\nHighly customer focused, accountable, responsive, and collaborative.\nStrong analytical and troubleshooting skills.\n\nEligibility:\n\nMust have 5+ years of experience in Python, and AWS Lambda.\nExperience with AWS cloud (ECS, EC2, VPC, ALB, S3, and other services).\nExperience in any one of the high-level programming languages such as (python, Java, and C++).\nExperience with containerization technologies like Docker, and Kubernetes is good.\nExperience with CDK / Terraform and configuration management systems.\nExperience with our technical stack (Python/Django) is a plus.\n\nLocations: Bangalore, Pune, Hyderabad, Mumbai, Nagpur, and Delhi NCR (Currently work from home).Other Details DepartmentGeneral / Other SoftwareIndustry IT IT - Software",
    "": ""
  },
  {
    "jobTitle": "Python Developer",
    "jobDescription": "Job Details                                                                                      Role:  Python Developer\nJob Description: We are looking for a Python Web Developer responsible to build functional and efficientserver-side applications, managing the interchange of data between the server and the users.Your primary focus will be the development of all server-side logic, ensuring high performanceand responsiveness to requests from the front-end. You will also be responsible for integratingthe front-end elements built by your co-workers into the application\nKey Responsibilities:\nHelp design and implement functional requirementsBuild efficient back-end features in PythonIntegrate front-end components into applicationsWriting reusable, testable, and efficient codeManage testing and bug fixesPrepare technical documentationCollaborate with UX/UI designers to implement design into the codeCoach junior team membersImplement software enhancements and suggest improvementsDeveloping digital tools to monitor online traffic\nRequirements and skills:\n3-5 years of Solid experience as Python DeveloperExperience with Python frameworks (e.g. Django, Flask, Bottle)Familiarity with Amazon Web Services (AWS) and REST APIUnderstanding of databases and SQL, MongoDBKnowledge of JavaScript and the react next's framework is a plus Familiarity with event-driven programming in PythonAble to create database schemes that represent and support business processes Proficient understanding of code versioning tools{{such-as Git,Mercurial-orSVN}}Knowledge of user authentication and authorization between multiple systems, servers,and environmentsKey Skills :  python Django MySQL MongoDB AWS git flask\nInterested candidates Kindly share the resume:\nContact No. hidden_mobile\nEmail: hidden_emailOther Details DepartmentIT Operations / EDP / MISIndustry IT IT - Software",
    "": ""
  },
  {
    "jobTitle": "Urgent | Hiring for Python Developer for one of US based client-Pune (WFH)",
    "jobDescription": "Job DetailsGreetings from Spirient Solutions !!\n \nAs we discussed please find the JD you have requested for. & the requirement for one of our client. So kindly check  below JD. & revert back to me.\nResponsibilities:\n- Build new products, services and add features to existing backend\n- Build reusable code and libraries for future use\n- Take complete end to end responsibility of a feature/module\n- Optimize application for maximum speed and scalability\n- Collaborate with other team members and stakeholders\nSkills:\n- 3+ years of engineering experience with a proven track record of building consumer services back-end\n- You're experienced in building backend using RESTful APIs in Python using Flask or Django framework\n- You're experienced in or willing to learn SQL & NoSQL Databases, Elasticsearch\n& Time series databases.\n- Ability to build & envision data model that suits product needs\n- Work closely with front end developers\n- Familiar with database architecture, scalability, performance and tuning.\n- Systematic problem-solving approach, coupled with a strong sense of ownership and drive\n- Experience with cloud infrastructure & services such as AWS (preferred), Google Cloud or MS Azure is a BIG plus.\n- Must have used git/github\n \nQualifications :\n- B.E./B Tech /M.E./ M Tech / MCA degree in Computer or Information Technology engineering.\n Location:Pune WFH\nNotice Period: Immediate to max 1month\n Other Details DepartmentWeb / Mobile TechnologiesEmbedded / System SoftwareIndustry IT IT - Software EducationGraduation",
    "": ""
  },
  {
    "jobTitle": "Python Developer",
    "jobDescription": "Job DetailsPython Developer - Preety -- Srinath (Ganesh) Category: Job Description: Python and Django experience Thane Location Key Skills: Python and Django experience Thane Location Location: \"Email Clients\", Copies, \"Email Strategy\", CAN-SPAM, Django, NumPy, SciPy, SQLAlchemy, PyQt,Other Details DepartmentGeneral / Other SoftwareIndustry IT Management Consulting / Strategy EducationGraduation",
    "": ""
  },
  {
    "jobTitle": "Looking Candidates for-Python Developer",
    "jobDescription": "Job DetailsJob Description: Python coding strong - 5+yrsAPI Development - 5+ yrs Lead experience minimum 3 yrsStrong hands on experience in Django / FlaskStrong Backend development like Data transformation Code DesigningCode ReviewKnowledge in deploymentDatabase Management Key Skills: Python coding strong - 5+yrsAPI Development - 5+ yrs Lead experience minimum 3 yrsStrong hands on experience in Django / FlaskStrong Backend development like Data transformation Code DesigningCode ReviewKnowledge in deploymentDatabase Management,Other Details DepartmentGeneral / Other SoftwareIndustry IT IT - Software EducationGraduation",
    "": ""
  },
  {
    "jobTitle": "Python Trainer and Developer",
    "jobDescription": "Job DetailsWe are looking for experienced python developer and trainer who has experience in python full stack along with django framework knowledge.Other Details DepartmentTechnical / Process TrainingIndustry IT IT - Software",
    "": ""
  },
  {
    "jobTitle": "apply now for the post of Senior Python Developer",
    "jobDescription": "Job DetailsJob Description Python3 - From dev POV, so can help team write proper Python3 code using FastAPI (or other OpenAPI compliant) (not just scripts) and help in review. - From cloud proficiency level; how to connect and manipulate cloud resources using SDKs (aws-sdk, boto3, etc).\nWorking AWS Cloud knowledge - To work with AWS cloud resources and understand how things are setup. General understanding of DevOps, GitOps, DevSecOps, automation, pipelines, etc - Good to have this skillset. - Jenkins shared library/ GitHub Actions. - Various DevOps tools in various stages.\nThis position is for Pune location with Tavisca, a cxloyalty Technology Platform (Division of JP Morgan Chase & Co.),Other Details DepartmentWeb / Mobile TechnologiesIndustry IT Banking / Financial Services EducationGraduation",
    "": ""
  },
  {
    "jobTitle": "Python Developer",
    "jobDescription": "Job Details*\nSkills :-\n\nMin 1yrs of hands on experience working with data pipelines.\nKnowledge in R Shiny.\nExperience working with ETL tool such as Airflow.\nExperience working with Time Series Forecasting Algorithms. \nSound Knowledge in programming skills such as Python, R.\nKnowledge in Database PostgreSQL, Mongo DB.\nKnowledge in Azure Big data store.\n\n\nGood problem solving skills.\n\n\nGood communication skills.\n\n\n\nResponsibilities:-\n\nDesigning, creating, building, and maintaining data pipelines to collating raw data from various sources and ensuring performance optimization.\nCandidate should be able to collaborate and solve complex problem with team member within the team or outside of the team.\nCandidate will be responsible of exploring new technologies in the application development area, create POC and evaluate the fitment for the given use case.\nCandidate will be responsible for analyzing new data source along with other data scientists.\n, *\nB Tech/BE\nExperience in Application DevelopmentOther Details DepartmentGeneral / Other SoftwareIndustry IT IT - Software EducationGraduation",
    "": ""
  },
  {
    "jobTitle": "Python Developer",
    "jobDescription": "Job DetailsPython Developer Category: Job Description: Python Developer Key Skills: Python Developer Location: Ahmedabad, Bangalore, Chennai, Delhi, Hyderabad, Kolkata, Mumbai, Pune, acity, Agartala, Agra Required Experience: 5-9 yrs Positions: 1 Contact Person:,Other Details DepartmentGeneral / Other SoftwareIndustry IT Management Consulting / Strategy EducationGraduation\"jobTitle",
    "": "jobDescription"
  },
  {
    "jobTitle": "Wanted Freshers For Front End Developer",
    "jobDescription": "Job DetailsGreeting From SBL IT Solutions!!!\nWe are looking for a qualified Front-end developer to join our IT team. You will be responsible for building the client-side of our web applications. You should be able to translate our company and customer needs into functional and appealing interactive applications.Responsibilities:\n \n\nUse markup languages like HTML to create user-friendly web pages\nMaintain and improve website\nOptimize applications for maximum speed\nDesign mobile-based features\nCollaborate with back-end developers and web designers to improve usability\nGet feedback from, and build solutions for, users and customers\nWrite functional requirement documents and guides\nCreate quality mockups and prototypes\nHelp back-end developers with coding and troubleshooting\nEnsure high quality graphic standards and brand consistency\nStay up-to-date on emerging technologies\n\nRequirements and skills:\n\nProven work experience as a Front-end developer\nHands on experience with markup languages\nExperience with JavaScript, CSS and jQuery\nFamiliarity with browser testing and debugging\nIn-depth understanding of the entire web development process (design, development and deployment)\nUnderstanding of layout aesthetics\nKnowledge of SEO principles\nFamiliarity with software like Adobe Suite, Photoshop and content management systems\n\nResume@hidden_email\nRegards,\nSBL MANAGEMENT Other Details DepartmentApplication Programming / MaintenanceIndustry IT IT - Software",
    "": ""
  },
  {
    "jobTitle": "Front End lead + architect",
    "jobDescription": "Job Details\nJob Description\n \nJob DescriptionWe are looking for aFront End lead + architect, to work as part of the eureQa productdevelopment team to lead the design and development of high impact user-centricenterprise-grade features within the eureQa platform. In this role, the candidate will have complete ownership of all UI aspects of the platform.While the candidate is expected to provide team leadership, this is not a management only position. The person filling this role is expected to be passionate about coding and should spend at least 40-50% of their time coding (implementing proof-of-concepts, developing common reusable code components, refactoring code, etc.,)Responsibilities: Implement the Front End technical design and development of enterprise-class webapplications that work seamlessly on desktop and mobile browsers. Review business requirements and perform technical analysis of requirements andparticipate in estimation process Drive architectural discussions for new platform features Deliver detailed technical design and architectural documentation Deliver high quality work product individually and as a team, adhering to industry bestpractices. Create governance with design system and manage the team delivering applicationsbased on that Contribute ideas for making the platform better and easier to use Lead frontend developers n agile squads to deliver Angular applicationsThe Complete Automation Platform for Testing Digital Applications2 Mentor and support team members Oversee and work closely with the development teams while constantly reviewing thecode and maintaining quality of the design. Continuously evaluate the existing software to identify areas of improvement andensure architectural integrity as feature enhancements are added.Requirements Bachelors or Masters degree in Computer Science or Information Systems Minimum 8 years experience in front end development and engineering Demonstrated ability to build elegant and engaging user interfaces Deep knowledge of JavaScript Knowledge of Material Design principles and responsive design Excellent written and verbal communication skills and ability to communicate withindividuals across the organization. Experience building progressive web applications is a plus Experience with Build and Deployment automation (CI/DC) Proven expertise in the following areas: Angular 9, React, jQuery and other JavaScript libraries JavaScript, TypeScript Object Oriented Java Scripting HTML5/CSS3 and other cross-browser responsive applications Modern back-end web technologies : JAVA, NodeJS, Python Building and using RESTful Web Services Component library framework integration (e.g. Angular Material) CSS frameworks like Sass, LESS Git, bower, grunt, yarn, and Yeoman Vector Icons like Font Awesome UI Testing & Runner Frameworks (Jasmine, Karma etc.)\nOther Details DepartmentGeneral / Other SoftwareIndustry IT IT - Software",
    "": ""
  },
  {
    "jobTitle": "Front End Engineer",
    "jobDescription": "Job Details\n\nJob Description\n \nWe are looking for a Frontend Developer who would be working on the bleeding edge of technologies.\nWe work primarily with React, Typescript and Redux.\nResponsibilities:\n\nUnderstand why a particular design was chosen and code accordingly\nWill have to deliver clean bug free unit tested code with minimal guidance\nStrive for continuous improvement by refactoring and applying best practices\nLearn and adapt to new technologies as necessary.\n\nRequirements:\n\nMust be proficient in React, Redux, Redux Toolkit and Typescript\nUsed Typescript for React Components\nUnit Testing, Component Testing, and Custom React hook tests with React Testing Library\nIntegration Tests with Cypress\nData Fetching libraries like Axios, React Query, RTK Query etc.\nShould have maintained React Components with Storybook.\nExperience contributing to open source software will be preferred\nUsed various CSS stylings methods like CSS Modules, LESS, SCSS, Tailwind, Styled Components, Emotion etc.\nShould understand Git\nAbility to work in a fast-paced and dynamic work environment\nExceptional interpersonal skills and demonstrated leadership abilities\n\n \n\n\nEducation/Experience\n \n\nExperience: 2+ years of relevant experience Very High priority\nExperience:10-12 years of experience: High\nCandidate with high level of expertise - Tier 1/2 college & company\n\n\nOther Details DepartmentGeneral / Other SoftwareIndustry IT IT - Software",
    "": ""
  },
  {
    "jobTitle": "FRONT-END DEVELOPER (Angular)",
    "jobDescription": "Job DetailsFRONT-END DEVELOPER (Angular) We are looking for a Front-End Web Developer who is motivated to combine the art of design with the art of programming. Responsibilities will include translation of the UI/UX design wireframes to actual code that will produce visual elements of the application. He/she will work with the UI/UX designer and bridge the gap between graphical design andtechnical implementation, taking an active role on both sides and defining how the application looks as well as how it works.Experience: 2-5 years\n Understanding of the entire web development process, with an emphasis on front enddesign and development Solid grasp of HTML, CSS, JavaScript, and various content management systems Ability to interpret and implement web designs Strong communication skills to effectively collaborate with designers, developers, andother relevant staff members or clients Willingness to troubleshoot and solve complex problems Ability to manage multiple projects and meet deadlines Good debugging skills Good analytical skills Good knowledge of OOPs concepts Should be a good team player Should know Agile methodologies Must be aware about DevOps concepts Must have hands-on on git or equivalent code repository system Should have knowledge of design patterns Technologies: HTML5, CSS3, SCSS JavaScript, typescript AngularJS, ReactJS Experience in consuming REST web servicesNice to have: Mobile hybrid application development Good experience in TDD approach Good experience in socket programming Good experience in cloud deployments\nEducation/ExperienceQualifications: Good Coder with/without any degreeCompensation: As per industry standards.Other Details DepartmentGeneral / Other SoftwareIndustry IT IT - Software",
    "": ""
  },
  {
    "jobTitle": "Front End/Mern stack developer",
    "jobDescription": "Job DetailsDear Candidate,We're Hiring for For Front End/Mern stack developer\nRoles & Responsibilities :-\n\n1. 2 +years of Software Development experience as a Front-End Developer.\n2. Good understanding of React.js & Node.js is a must.\n3. Thorough understanding of React.js and its core principles.\n4. Strong background in MVC/MVVM frameworks.\n5. Extensive knowledge of HTML5, JavaScript, CSS/CSS3, JQuery, SCSS, Bootstrap\n6. Should have the knowledge Angular (8+), JIRA, etc\n7. Understanding fundamental design principles behind a scalable application\n \n\n\nEducation/Experience\n \nExperience:2-4 years\nSalary:30K To 40K\n\nRegards,\nTeam HROther Details DepartmentGeneral / Other SoftwareIndustry IT IT - Software",
    "": ""
  },
  {
    "jobTitle": "Front end Developer",
    "jobDescription": "Job Details\nJob Description\n \nWe are looking for a Frontend Developer who would be working on the bleeding edge of technologies.\nWe work primarily with React, Typescript and Redux.\nResponsibilities:\n\nUnderstand why a particular design was chosen and code accordingly\nWill have to deliver clean bug free unit tested code with minimal guidance\nStrive for continuous improvement by refactoring and applying best practices\nLearn and adapt to new technologies as necessary.\n\nRequirements:\n\nMust be proficient in React, Redux, Redux Toolkit and Typescript\nUsed Typescript for React Components\nUnit Testing, Component Testing, and Custom React hook tests with React Testing Library\nIntegration Tests with Cypress\nData Fetching libraries like Axios, React Query, RTK Query etc.\nShould have maintained React Components with Storybook.\nExperience contributing to open source software will be preferred\nUsed various CSS stylings methods like CSS Modules, LESS, SCSS, Tailwind, Styled Components, Emotion etc.\nShould understand Git\nAbility to work in a fast-paced and dynamic work environment\nExceptional interpersonal skills and demonstrated leadership abilities\n\n \n\n\nEducation/Experience\n \n\nExperience: 2+ years of relevant experience Very High priority\nExperience:10-12 years of experience: High\nCandidate with high level of expertise - Tier 1/2 college & compan\n\nOther Details DepartmentGeneral / Other SoftwareIndustry IT IT - Software",
    "": ""
  },
  {
    "jobTitle": "Front End Engineer",
    "jobDescription": "Job DetailsDescription:\nBA/MA in computer science or similar field\n4+ years of experience in front end web development\nProficient understanding of web markup, including HTML5, CSS\nProficient understanding of client-side scripting and JavaScript/TypeScript frameworks\nGood understanding of React-Redux (Flux) or AngularJS or VueJS\nGood understanding of asynchronous request handling, partial page updates etc.\nProficient understanding of cross-browser compatibility issues and ways to work around them\nProficient understanding of code versioning tools, such as Git\n,  Job Responsibilities:\n\n\nDevelop new user-facing features\n\n\nBuild reusable code and libraries for future use\n\n\nEnsure the technical feasibility of UI/UX designs\n\n\nOptimize application for maximum speed and scalability\n\n\nWrite Unit and Storybook tests\n\n\nCollaborate with other team members and stakeholders\n\n\nParticipate in work estimation and planning\n\n\nParticipate in agile development process (SAFe)\n\n\n\nOther Details DepartmentBack Office OperationsGeneral / Other SoftwareIndustry IT IT - Software EducationGraduation",
    "": ""
  },
  {
    "jobTitle": "Associate - Java/J2EE",
    "jobDescription": "Job Details\n\n\nAssociate - Java/J2EE\n\n\n\nJob Description2 positions one with strong front end testing experience and the other with back end testing experience. The ideal candidate will be responsible for a variety of responsibilities, including: Interact with the team and stakeholders to understand project/product requirements. Create and maintain/update test plans and test cases to execute them in accordance with the SDLC in an agile environment. Collect and create test data for both functional and non-functional testing. Execute automated tests (already created) to ensure the overall quality after new changes are introduced. Actively participate in agile ceremonies, providing accurate and timely feedback regarding both the process and the product. Coordinate testing activities with other QA engineers and their teams. Help to triage and escalate issues based on their severity when needed. Ensure quality and consistency across different applications and environments which interact between them. Provide timely and precise information about the testing activities and their outcome.\nQualifications:The ideal candidate would have:\nAutomation knowledge with tools such as selenium, and/or cypress, Rest-Assure, or others Experience with REST/SOAP API testing Strong knowledge on QA methodologies, tools, and processes Troubleshooting skills Proven work experience in software development Experience writing clear and concise test plans and test cases (using test design techniques) for web/responsive apps Experience using tools such as Jira, Git, X-Ray/Zephyr, postman, etc. Agile-Oriented  Good English communication skills, written and verbal (English level: B2+ or above) Good troubleshooting skills\nBonus skills: Experience working with financial software is a plus Good knowledge of SQL and scripting Hands-on experience with test automation is a plus Security/Performance testing experience is a plus Mobile (Native) testing experience is a plus ISTQB or other certification is a plus\nEducation/Experience 4+ years of experience in Quality Assurance positions\nBachelor's degree in computer science, software Development or relatedOther Details DepartmentGeneral / Other SoftwareTestingIndustry IT IT - Software",
    "": ""
  },
  {
    "jobTitle": "Senior Node Developer",
    "jobDescription": "Job DetailsExperience Requirement: 5 - 7 years\nJob Description:\nWorking in back-end web development with Node.js\nWorking with Nodejs\nTDD/BDD experience\nExperience with server-side templating languages\nExperience with Express.js, Loopback, SailsJS, Meteor.js or other frameworks.\nExperience consuming and building robust, SOAP and RESTful APIs\nExperience with Relational Databases like MongoDB, MySQL\nSolid understanding and extensive experience with version control tools like Git, SVN or Mercurial\nExceptional problem solving and ability to work independently\nExceptional learning skills\nUnderstanding of Agile methodologies\nNice to have:\nStrong Computer Science fundamentals\nExperience building scalable systems with cloud infrastructures like AWS.\nJob Responsibilities: Educational Qualifications:\nAny graduation from technical stream\n1.Develop and ship highly available and scalable back-end, front-end, and database software components\n2.Grow and mentor software engineers and work with them to identify, design, prototype, and evaluate great product features\n3.Implement critical components and help define the architectural vision, collaborating with partner teams across the organization, and mentoring and developing more junior engineers Develop automated tests and deliver high quality code to production within a short development cycle in continuous integration and delivery environment\nJob Type: Full-time\nSalary: Up to 200,000.00 per month\nBenefits:\n\nFlexible schedule\n\nSchedule:\n\nDay shift\n\nSupplemental pay types:\n\nJoining bonus\n\nAbility to commute/relocate:\n\nGurugram, Haryana: Reliably commute or planning to relocate before starting work (Required)\n\nEducation:\n\nBachelor's (Preferred)\n\nExperience:\n\ntotal work: 5 years (Preferred)\n\n*Speak with the employer* +91 hidden_mobileOther Details DepartmentClient ServerApplication Programming / MaintenanceIndustry IT IT - Software",
    "": ""
  },
  {
    "jobTitle": "Angular Developer",
    "jobDescription": "Job DetailsDear Candidate ,\n \nGreetings from RHEINBRUCKE IT CONSULTING PRIVATE LIMITED !!!\n \nWe are looking for Angular Developer with 4 to 6 years of experience \n \nDesired Skills and Competencies: \nProficient understanding of web markup, including HTML5, CSS3, JavaScript, JQuery\nDeep knowledge and experience in Angular (Version 4 and above), TypeScript\nExperience in Integrating REST APIs\nFluent in JSON data manipulations\nStrong exposure in designing Responsive web applications with Bootstrap and material design libraries\nExposure with front-end tools like - Webpack, AngularCLI, NPM\nGood understanding of asynchronous request handling, partial page updates, and AJAX\nProficient understanding of code versioning in GIT\nExperience in integrating third-party tools/frameworksOther Details DepartmentApplication Programming / MaintenanceIndustry IT IT - Software\"jobTitle",
    "": "jobDescription"
  },
  {
    "jobTitle": "Full Stack Developer",
    "jobDescription": "Job DetailsEther Services is a Software Product Development Company. We developed products related to Food Delivery, Vacation Rentals, ecommerce and help startup companies.\n \nWe are looking for Interns who have very good knowledge in Full Stack Developer for a period of 3 to 6 months.\n \nOnly Freshers apply for this.\n \nProject Experience in Full Stack Python is Must.\n \nInterested and eligible candidates apply.\n \nJob Location: Coimbatore.Other Details DepartmentApplication Programming / MaintenanceWeb / Mobile TechnologiesIndustry IT IT - Software",
    "": ""
  },
  {
    "jobTitle": "Full Stack Developer (Angular + Nodejs) Bangalore",
    "jobDescription": "Job DetailsJob Description:\nWe are looking for a highly capable Node.js developerto optimize our web-based application performance. Collaborating with our front-end application developers, designing back-end components, and integrating data storage and protection solutions.\n \nFull Stack Responsibilities:\nDeveloping and maintaining allserver-side network components. Ensuring optimal performance of the central database and responsivenessto front-end requests. Collaborating with front-end developers on the integration of elements. Designing customer-facing UI and back-end servicesfor various business processes. Developing high-performance applications by writing testable,reusable, and efficient code. Implementing effective security protocols, data protection measures, and storage solutions. Running diagnostic tests,repairing defects, and providing technicalsupport. Documenting Node.js processes, including database schemas, as well as preparing reports. Recommending and implementing improvementsto processes and technologies. Keeping informed of advancementsin the field of Node.js development.\n \nRequirements: Bachelor's degree in computerscience, information science, orsimilar. At least two years of experience as aNode.js developer. Extensive knowledge of JavaScript, web stacks, libraries, and frameworks. Knowledge of front-end technologiessuch as HTML5 and CSS3, Angular, Reactjs. Superb interpersonal, communication, and collaboration skills. Exceptional analytical and problem-solving aptitude. Availability to resolve urgent web application issues outside of business hours\nContact Details:hidden_mobile/hidden_email\n \nExperience:2 to 5 years\n \nAnnual CTC:Rupees 6,00,000 to 10,00,000Other Details DepartmentApplication Programming / MaintenanceIndustry IT IT - Software",
    "": ""
  },
  {
    "jobTitle": "Full Stack Magento Developer",
    "jobDescription": "Job DetailsJob DescriptionExperience Required - 1 - 5 year\nJob Location - Ahmedabad/Bhavnagar\nSkills - Should have worked in Magento 2 Other Details Terms -\nTerms & Conditions: We have 2 Year Service Agreement (Service Agreement amount is the last 2 months salary)\n Timings - 9:30 - 6:30 (Between 1 hour of lunch break) Day offs - 5 Days Working (We have 1st, 3rd and 5th Saturday Off). Team Size - 25 - 30 Number of applicants - 5-10Other Details DepartmentGeneral / Other SoftwareIndustry IT Recruitment Services",
    "": ""
  },
  {
    "jobTitle": "Full Stack dot net developer",
    "jobDescription": "Job Details\nHands on experience in ASP.NET, Entity Framework, LINQ, MVC 3.0 and above,\n\n \n\nC# HTML, CSS, JavaScript/jQuery, Bootstrap, Angular and React\n\n \n\nWeb API, SQL, any reporting tools experience\n\n \n\nDesigning, coding, debugging and deploying applications\n\n \n\nShould have working experience as a Full Stack Developer\n\n \n\nAbility to be both a strong team player and individual contributor\n\n \n\nGood communication skills\nOther Details DepartmentApplication Programming / MaintenanceIndustry IT IT - Software",
    "": ""
  },
  {
    "jobTitle": "Sr Full stack Developer",
    "jobDescription": "Job DetailsDear Candidates,\n \nKindly find the Job Description below.\n\n\nSchema-free/flexible databases using NoSQL technologies like MongoDB.\n\n\nSSO, SAML, OAuth, JWT for API and Web Session Authentication and Authorization.\n\n\nDemands and expectations of enterprise software customers would be a plus.\n\n\nPossess a solid debugging process and exhibit technical intuition.\n\n\n3+ years of technical experience in building scalable Web applications.\n\n\nJavaScript frontend framework/libraries like Angular 4/5/6, and Node JS backend, MongoDB Database.\n\n\nNode JS and its framework/libraries like Express.\n\n\nCSS and its pre-processors like SASS/LESS.\n\n\nHands-on experience with Object Oriented JavaScript, LESS/SASS.\n\n\nGood understanding of REST APIs and its security techniques.\n\n\nBuild tools like Docker.\n\n\nAbility to build a feature from scratch & drive it to completion.\n\n\nKnowledge of Datasets like Firebase, AWS, MQTT, CoAP.\n\nOther Details DepartmentGeneral / Other SoftwareIndustry IT IT - Software",
    "": ""
  },
  {
    "jobTitle": "Software Engineer (Full/Mean Stack)",
    "jobDescription": "Job Details\nKey Responsibilities/ Position Description\n\nPlan, organize and develop new ideas/features for our dynamic ads platform.\nWork with other members to develop and integrate new features including other third-party systems and plugins into our platform.\nDocument and maintain software functionalities.\nEvaluate and identify new technologies for implementation and incorporation.\nCommunicate with our business and product heads to understand clients requirements.\nRespond and follow up to incorporate feedback and draw new insights.\nPrioritize tasks to meet multiple deadlines.\n\n\n, Requirements\n\n\nBeing a MEAN Stack developer you should have relevant experience into Mongo DB, Express JS, Angular JS and Node JS.\nAt least 2-4 years of working experience as a Fullstack developer\nAble to join immediately is a BIG plus\nUnderstanding of the front-end and back-end processes;\nAbility to work with HTML / CSS.\nAbility to work with databases.\nUnderstanding of programming templates and architecture design guidelines;\nProfiling and optimizing applications.\nPossess at least a Degree or Diploma in any field, preferably computer science / IT related;\nWillingness to learn and able to pick up new technology or new concepts fast;\nAble to work independently as well as in collaborative mode with minimum supervision;\nWork productively even under pressure;\nPossess good work ethic, attitude with good follow-through;\nExcellent communication in written and spoken English.\n\n\nOther Details DepartmentGeneral / Other SoftwareIndustry IT IT - Software EducationGraduation",
    "": ""
  },
  {
    "jobTitle": "Full Stack Architect - Node.js/React.js/Graph QL",
    "jobDescription": "Job DetailsResponsibilities :The key accountabilities for this role are to :1. Architect, design, and implement large scale and enterprise-grade Custom solutions2. Assess, estimate, and support opportunities or business development in our clients3. The deliverables for each Sprint are clearly understood by the Agile Team(s). Ensure that the Agile team(s) delivers working software of sufficient quality to deliver to clients at the end of each development sprint.4. Provide Risk Management for all technical risks5. Write maintainable and effective code base. Follow best practices for test driven environment, continuous integration.Skills :1. Minimum 10+ years of experience2. Bachelor's degree in engineering, computer science, information systems, or a related field from an accredited college or university; Master's degree from an accredited college or university is preferred3. Hands on experience in one or more programming language/development platforms such as NodeJS(mandatory, 5+ years), ReactJS(mandatory, 5+ years),GraphQL, Hooks, Promises4. Hands on experience in writing RESTful apis, auth/authorization, security of apis, versioning5. Good understanding of Ajax, CORS, api integration, HTML5/CSS36. Experience in JS unit testing framework like JEST/Mocha, ChaiOther Details DepartmentApplication Programming / MaintenanceIndustry IT IT - Software",
    "": ""
  },
  {
    "jobTitle": "Soft Skills Trainer",
    "jobDescription": "Job DetailsDear Aspirant,\nWalk1st floor, Bidarkota apartment, Above apollo pharmacy, Shloka college Building, Sr Nagar, Hyderabad.\nJOB DETAILS :\nJob role - Java Full stack Trainer and Python Full stack Trainer\n-In Drive on 13 Sep 2022 @11AM\nContact numbers:\nMail Id:hidden_email\nReshma : hidden_mobile\nWALK-IN DETAILS:\nDate :13rd Sep 2022\nTime :11AM\nCandidate should have an experience with java full stack and python full stack .\nAlso have an experience with UI development courses\nImmediate Requirement.Good communication skills in Hindi & English\nADVANTAGES :\nClient would be available at GlobalEdx Grooming before every Interview RoundRefer your friends and relative if they fit into the above profile\n------------------------------ --------Regards,Reshma- HR \nGlobalEdx Learning and Technology Solutions Pvt Ltd.1st floor, Bidarkota apartment, Above apollo pharmacy, Shloka college Building, Sr Nagar, Hyderabad-500038Other Details DepartmentTechnical / Process TrainingIndustry IT IT - Software",
    "": ""
  },
  {
    "jobTitle": "Full Stack .Net Developer",
    "jobDescription": "Job Detailsjob Role -Dot Net Full Stack Developer\nExperience - 3 Yrs to 10 Yr\nNotice Period - 15 Days\nSkill - .Net , React JS , C# SQL\nLocation - Bangalore\n \n \n \nInterested Candidate Drop Resume On hidden_email\n \n \n Other Details DepartmentApplication Programming / MaintenanceIT Operations / EDP / MISIndustry IT IT - Software",
    "": ""
  },
  {
    "jobTitle": "Java Full Stack Developer(Reactjs and Node JS)",
    "jobDescription": "Job DetailsLocation : Benguluru / Chennai\nEmployment - On Permanent paytoll with TechStar, will be deployed to End client\nSalary : upto 30 LPA\nExperience : 4+ Years\n \nJob Description\n\n4+ years of software development experience.\nHands-on programming experience in java/Spring boot & ReactJs/Node/JavaScript.\nHands-on experience in writing SQL Queries and understanding of Complex SQL Queries.\nGood knowledge of design aspects, testing, and programming concepts like object-oriented design, microservices, cloud, automation, and REST APIs\nGood Knowledge of DevOps frameworks like Azure DevOps pipelines.\nExperienced in Agile or Scrum software development methodologies.\nGood communication skills, both verbal and written.\n\nResponsibilities:\n\nBuild the front-end of applications through appealing visual design\nDevelop and manage well-functioning databases and applications\nWrite effective APIs\nTest software to ensure responsiveness and efficiency\nTroubleshoot, debug and upgrade software\nBuild features and applications with a mobile responsive design\nWrite technical documentation\nWork with development teams and product managers to ideate software solutions\nProblem-solving and analytical skills\nAbility to adapt to new technology, concept, approaches, and environment faster\nEager to learn new technologies\nOther Details DepartmentWeb / Mobile TechnologiesApplication Programming / MaintenanceIndustry IT IT - Software EducationGraduation\"jobTitle",
    "": "jobDescription"
  },
  {
    "jobTitle": "Data Scientist (ML/AI)",
    "jobDescription": "Job DetailsDear Candidate,We're Hiring for \n\n\n\n\nData Scientist (ML/AI)\n\n\n\nRoles & Responsibilities :-\n\n\n12th pass or graduate requiredgood with MS officefast in typing and error free data entry\n\n\nRegards,\nTeam HROther Details DepartmentData EntryIndustry IT IT - Software",
    "": ""
  },
  {
    "jobTitle": "Data Scientist",
    "jobDescription": "Job Details\nMin 2 years of hands-on experience in predictive modelling and analysis, predictive software\ndevelopment\nExperience implementing ML algorithms such as Logistic Regression, Naive Bayes, Bayesian\nNetwork, Decision Tree, Bagging/boosting, convex optimization, Deep learning\nHands-on experience on a minimum of 2 projects that involves Deep Learning\nExcellent organisational and analytical skills\nExposure to REST concepts will be a plus\nExpert knowledge in development will be a plus\nOther Details DepartmentData EntryIndustry IT IT - Software",
    "": ""
  },
  {
    "jobTitle": "Data analyst / Data scientist",
    "jobDescription": "Job DetailsExperience:06 to 2 years\nLocation:Vadodara, India\nSalary:1.2 LPA to 2.4 LPA.\nFull-time\nThe company looks forward to hiring candidates with stability (minimum one year) and zeal to learn and grow.Other Details DepartmentIT Operations / EDP / MISIndustry IT Recruitment Services",
    "": ""
  },
  {
    "jobTitle": "Data Scientist/Senior Data Scientist",
    "jobDescription": "Job Details\nData Scientist/Sr. Data Scientist\n\nSkills : APLD (mandate) , Python/R, SQL, Predictive ModellingJob Responsibility :- Apply a broad array of analytics skills including machine learning, statistics, text-mining/NLP, and modeling to extract insights from structured and unstructured data sources and complementary real-world & digital information streams to business challenges- Developing and evolving core commercial models used across all analytics packages. Examples of the models will be ; Multi-Channel Analytics, Patient Pathways, Omni-Channel Segmentation, Territory Design, Customer Targeting, Attribution Modeling, & Predictive Commercial Mix- Design data test and learn experiments to drive personalized solutions across the customer journeys addressing key customer needs as well as enabling personalized experiences across each touch points through connective analytics.- Collaborate across business to prototype, launch and Iterate analytics capabilities that quickly scale globally- Lead the collaborate with local and global teams to ensure data driven decisions are embedded into business process.- Automate analytics models and simplify information managementQualifications :- Bachelor's degree in computer science or related field, with 6+ years of demonstrated experience in developing product-level ML algorithms, with a proven track record of successfully delivering applied research to production (4+ with Masters)- Strong written and verbal communication skills- Excellent problem solving and data analysis skills, with expertise in developing or applying predictive analytics, statistical modeling, data and text mining/NLP, or machine learning algorithms on structured and unstructured data, at scale- Applied research experience in machine learning or deep learning or information retrieval or data analytics- Develop insights and storylines through translation of analysis and modeling- Build and deploy tools and methodologies to create solutions enabling analytics and measurement of sales and marketing activities (e.g., market-mix modeling, cross-channel attribution, omni-channel segmentation and customer targeting, patient pathways, omni-channel customer journey analysis and optimization etc.)- Develop insights and storylines through translation of analysis and modeling- End to end experience in retrieving data and developing an executive-level analysis through advanced analytics techniques- Partner with leaders from across the business to translate the company's business objectives, market opportunities & portfolio of offerings into a formal, cohesive global commercial strategy- Lead the development and implementation measurement planning aligning to strategy.- Lead the collaborate with local and global teams to ensure data driven decisions are embedded into business process.- We are looking for professionals with these skills to achieve our goals. If YOU have these skills, we would like to speak to you.- Hands on experience using Apache Spark, Python, R, SQL and Data Visualization tools- Experience or understanding of end to end software tool/solution development and life cycle management- Intellectual Curiosity- Knowledge of the data landscape in healthcare (EHR, claims data, real world data, HEOR data)- Relevant years of experience (pharma data sets)Senior data scientist : 5 years in APLDData Scientist : 1 year in APLDSKILLS & CAPABILITIES : PATIENT ANALYTICS1) Expertise in APLD across all therapy areas (Examples below are illustrative & NOT exhaustive) : MUST HAVENOTE : Expectation is that capability will not be restricted to using data & creating output. There should be a strong understanding of what the output means and to have judgement in assessing the reasonability and meaningfulness of output.a) Patient eligibilityb) Look-back & look-forward rules c) Source of Businessd) Alignment to zip, DMA, MSA, County, State, Providere) Patient adherence measuresf) Discontinuation analysesg) Referral patternsh) Refill gapsi) Refill Patternsj) Patient Pathway analysis2) Technical Skills : a) SQL : MUST HAVEb) Python/R : MUST HAVE3) Methodological capabilitiesa) Correlation analyses : MUST HAVEb) Segmentation & Clustering : MUST HAVEc) Design of Test/Control framework : NICE to HAVEd) Predictive modeling: MUST HAVEe) Outlier Detection : MUST HAVEf) Imputation & Simulation : MUST HAVE4) Consultation on methodology/solution design for business questions : MUST HAVE5) Data Assets beyond APLD-Xponent, DDD, SPP : MUST HAVEYou could connect with me via LinkedIn at https://www.linkedin.com/in/karishma-narang-ahidden_mobile9/\n,Other Details DepartmentDBA / DatawarehousingIndustry IT Management Consulting / Strategy EducationGraduation",
    "": ""
  },
  {
    "jobTitle": "Lean SigmaSenior Data Scientist Data & Analytics",
    "jobDescription": "Job DetailsRole & Responsibilities Work closely with global & regional teams to architect, develop, and maintain advanced reporting and data visualization capabilities on large volumes of data to support analytics and reporting needs across products, markets and services. Obtain data from multiple sources, collate, analyze, and triangulate information to develop reliable fact bases. Effectively use tools to manipulate large-scale databases, synthesizing data insights. Execute cross-functional projects using advanced modeling and analysis techniques to discover insights that will guide strategic decisions and uncover optimization opportunities. Build, develop and maintain data models, reporting systems, dashboards and performance metrics that support key business decisions. Extract intellectual capital from engagement work and actively share tools, methods and best practices across projects  Provide 1st level insights/conclusions/assessments and present findings via Tableau/PowerBI dashboards, Excel and PowerPoint.  Apply quality control, data validation, and cleansing processes to new and existing data sources. Lead, mentor and guide more junior team members. Communicate results and business impacts of insight initiatives to stakeholders in leadership, technology, sales, marketing and product teams. Bring your Passion and ExpertiseAll About You  Experience in data management, data mining, data analytics, data reporting, data product development and quantitative analysis  Financial Institution or a Payments experience a plus Experience presenting data findings in a readable and insight driven format. Experience building support decks. Advanced SQL skills, ability to write optimized queries for large data sets (Big data) Experience on Platforms/Environments: Cloudera Hadoop, Big data technology stack, SQL Server, Microsoft BI Stack Experience with data visualization tools such as Looker, Tableau, PowerBI Experience with Python, R, a plus,Other Details DepartmentGeneral / Other SoftwareIndustry IT Banking / Financial Services EducationGraduation",
    "": ""
  },
  {
    "jobTitle": "Tredence - Data Scientist - Data Science/Machine Learning Operations - WalkIn",
    "jobDescription": "Job Details\nWalk in Recruitment for Data Science and MLOPs  \n\nData Scientist (1-7 yrs)Criteria:Mandatory project experience in Data Science with hands on in Sql, Python, Supervised Learning, Un-Supervised Learning, reinforcement learning and Time Series ForecastingRole Brief- As a Data scientist you will solve some of the most impactful business problems for our clients using a variety of AI and ML technologies. You will collaborate with business partners and domain experts to design and develop innovative solutions on the data to achieve predefined outcomes.Key Responsibilities:- Engage with clients to understand current and future business goals and translate business problems into analytical frameworks- Develop custom models based on in-depth understanding of underlying data, data structures, and business problems to ensure deliverables meet client needs- Create repeatable, interpretable and scalable models - Effectively communicate the analytics approach and insights to a larger business audienceEducation: Engineering Grads or MA / MSc from Statistics/ Maths/ Economics background who have graduated in 2021 or beforeMachine Learning Engineer (1-7 yrs)Criteria:Mandatory project experience in any Machine Learning Platforms (ML Flow, DataIKU, Sagemaker, VertexAI) and Python. Devops, Docker, Kubernates, Data Engineering with Pyspark experience are good to have.Role BriefAs a Machine Learning Engineer you will solve some of the most impactful business problems for our clients using a variety of AI and ML technologies. You will collaborate with business partners and domain experts to design and develop innovative solutions with the models to achieve predefined outcomesTHE IDEAL CANDIDATE WILL- Engage with clients to understand current and future business goals and translate business problems into high level solution approach- Work hands-on on building the model deployment and monitoring pipelines based on in-depth understanding of underlying data, data structures, and business problems to ensure deliverables meet client needs- Effectively communicate the approach and insights to a larger business audience- Collaborate with team members, peers and leadership at Tredence and client companiesEducation: Engineering Grads or MA / MSc from Statistics/ Maths/ Economics background who have graduated in 2021 or beforeTimings: 9:30 AM to 1 PMDate - 2nd July 2022Interview venue: Tredence Analytics, 2nd Floor, Sattva Knowledge Court, 20 21, 7th Cross Rd, Green Domain Layout, EPIP Zone, Whitefield, Bengaluru, Karnataka 560048\n,Other Details DepartmentGeneral / Other SoftwareIndustry IT Management Consulting / Strategy EducationGraduation",
    "": ""
  },
  {
    "jobTitle": "Data Scientist - (BERT, NLP), Kubeflow (or) ML Ops",
    "jobDescription": "Job Details\n\n\nData Scientist - (BERT, NLP), Kubeflow (or) ML Ops\n\n\n\nJob Description\nExperience: 1 to 5 Years\nSalary: 25 to 55K Per Month\n \nWe're seeking for a SQL Server DBA with experience to join our team! You will be responsible for the installation, configuration, maintenance, and performance of important SQL Server RDBMS systems as a SQL Server DBA. Responsibilities\nManage SQL Server databases\nConfigure and keep database servers and processes up to date.\nKeep an eye on the system's health and performance.\nEnsure good performance, availability, long-term viability, and security.\nReal-time problem analysis, resolution, and correction\nMake recommendations for solutions.\nRegular processes should be refined and automated, issues should be tracked, and modifications should be documented.\nAssist with query tuning and schema refinement for developers.\nProvide assistance for important production systems 24 hours a day, 7 days a week.\nAfter hours, do regular maintenance and assist with release deployment activities.\nQualifications and requirements\nB.Tech/MCA/MCP/MCTS/MCITP\n1-5 years of experience working as a SQL Server DBA or in a similar position 1-2 years of administration expertise with MY SQL Server/PostgreSQL is necessary.\n1-5 years of Windows Server and Linux Server experience\nA sense of pride in your work and its contribution to the company's success.\nProblem-solving abilities and critical thinking\nTeam player\nExcellent time-management abilities\nOutstanding interpersonal and communication abilities experience 1 to 5 years (1-2 years of administration expertise).\n Other Details DepartmentDBA / DatawarehousingIndustry IT IT - Software",
    "": ""
  },
  {
    "jobTitle": "Engineer II - Data scientist",
    "jobDescription": "Job Details\nJob Description\n \nRoles and Responsibilities\nConvert requirements to responsive and user friendly web pages using Figma Illustrate design ideas using storyboards, process flows and sitemaps Optimize web pages for maximum speed and minimum resource requirements Build the front-end of applications through appealing visual design Test software to ensure responsiveness and efficiency Prepare Unit Test Plans Implement UI validation where applicable. Debug and Write SQLs required for back-end integration Writing well designed, testable, reusable, efficient code Manage 1-2 Engineer I - Fullstack Developer Dockerize Angular Applications Deploy Bodhee microservices\n \n\n\nEducation/Experience\n \nKey Skills Must have 3+ years of experience in HTML, CSS, SCSS, JavaScript, TypeScript, Bootstrap4, Angular2+ Good understanding of API integration Working knowledge of Caching Basic understanding of Cloud Infrastructure HighChartJS, D3JS Git, Docker, Jenkins Experience with Linux environment Creative Problem Solving & Analytical skills Eager to learn and develop a career as a Fullstack Developer Agile, Flexible and a Team Player Hands on experience on any of MVC framework Understanding of layout aesthetics Proficient understanding of cross-browser compatibility issues and ways to work around them.\nOptional: Java8, Play Framework / Spring Boot Good understanding of RDBMS(Postgres and TimescaleDB) and experience with SQL Kafka\nOther Details DepartmentSite Engineering / Project ManagementGeneral / Other SoftwareIndustry IT IT - Software",
    "": ""
  },
  {
    "jobTitle": "Sr. Data Scientist",
    "jobDescription": "Job Details\nCollaborate with internal customers to capture requirements, design solutions & make recommendations\nDeliver Technical Specifications documents for review\nCollaboration with team software engineer resources onshore & offshore\nLeverage understanding of data relationships and schemas to structure data to enable multi-layered customer-level analysis\nConstruct processes to build Customer ID mapping files for use in building 360 degree view of customers across data sources.\nLeverage scripting languages to automate key processes governing data movement, cleansing and processing activities.\nInnovate on new methods to address customer needs.\n\nWhat you need to succeed \n\nBachelors or Masters degree in Computer Science, Engineering, Data Sciences, Statistics, or a related analytics field.\n5+ years of strong experience with data transformation & ETL on large data sets, hands on SQL / NoSQL experience including Data Modeling.\n,Other Details DepartmentGeneral / Other SoftwareBio Tech / R&D / ScientistIndustry IT IT - Software EducationGraduation",
    "": ""
  },
  {
    "jobTitle": "Looking Candidates for-Data Scientist - Associate",
    "jobDescription": "Job DetailsRequisition Title: Data Scientist Associates - CCB Workforce Planning\nJob Title: Data Scientist Associates\nJob Grade: 601\nLocation: Mumbai / Bengaluru\nManager: Mukesh Patil\nTeam: Workforce Planning\n   Job Description   \nWorkforce Planning (WFP) organization is a part of Consumer and Community Banking Operations division. Workforce Planning Data Science team is tasked with delivering quantitatively driven solutions to support the core WFP functions (demand forecasting, capacity planning, resource scheduling, and business analysis & support). The WFP team supports Chase s call centers, back office, and ~5,200 retail branches.\nProjects engaged by the Data Science team can be complex, data intensive, and of a high level of difficulty, each having significant impact on the business. Typically, these problems will be of an unstructured nature, whereby the employee will be expected to quickly assess and comprehend the situation then develop a practical problem-solving strategy. You will be expected to analyze the topic in question, develop solution proposals and review their results and next steps with management for prioritization, timing, and delivery. \nThe data science optimization team is supported by the next-gen data science solutions that move us closer to real-time inference, decision making, and optimizing:\n\nSchedule Optimization Predictive scheduling and optimization, shift optimization\nOperations Research Branch, call center, back-office networks simulation, Supply Chain, Inventory Management, Digitization and What-if scenarios testing\nYield/Revenue Management Rationalize cost to serve vs service levels, penalty cost modeling meeting contractual agreements at varying degrees of capacity, head count, and schedule impacts \nSupply Forecasting Staffing, service levels, and stress forecasting and outlooks\n\n   Responsibilities   \nThe Data Scientist Associates  (Optimization) will have the economics underpinning with a desire to make a large business impact for lines of business/functions with their thought leadership delivering strategic projects using exciting big data environments, econometrics, statistics, and technology solutions. You will have outstanding attention to details, comfortable under ambiguity and affinity for problem solving, evaluating trends and anticipating requirements directly supporting the broader CCB WFP objectives, to ensure clients, partners, stakeholders have the best and most predictive/prescriptive data available for decision making. The Data Scientist Associates shall work together at the intersection of AI, ML, Econometrics, applied scientific computing to ensure Chase maintains the best quantitative models and optimization.\n\n   Qualifications   \n  Educational Background  \nBachelor s Degree or Master s+ with 4+ years of experience with different micro & macro-economic characteristics as an Optimization professional (e.g., OR analyst, statistician, industrial engineer, or related professions) in a quantitative field: Statistics, Engineering, Operations Research, Economics, Mathematics, Machine Learning, Artificial Intelligence, Decision Sciences, and related disciplines.\n  Technical Skills  \n\nAdvanced expertise with  Queuing theory, linear and non-linear programming, integer programing,  network analysis, replacement problems, sequencing, dynamic problem, pricing elasticity, cost structuring, benefits/loss propositions, and other ad-hoc strategies such as remediation plans regarding pricing policies, risks, controls\nFamiliarity with utility-theory, graph theory based discrete choice-modeling, \nAbility to adapt/modify existing or build new statistics models, machine learning models, and/or operations research simulations and models.\nDevelop and monitor KPIs, metrics, SLAs that attain customer strategies using statistical models, heuristics, and scalable algorithms\nProgramming languages: Python, R\n\n  Ideal Skills  \n\nUnderstand business problems to turn cost to serve profiles into useful analyses and convey recommendations in pricing tactics, margin models engaging with technology counterparts to maximize value even falling short to meet capacity target consistent with defined contract agreements, scheduling gaps, inadequate staff levels.\nCommunicate complicated concepts and relevant scientific insights from data clearly to business leaders and strong record of executing pricing processes and applied use cases to optimize overall margins, staff allocations to sustain headcount planning & performance\nAbility to analyze live customer demand and react to last-minute changes such as inclement weather or operational capacity constraints or any potential staff or scheduling impacts\n\n  Other Good to have Skills  \n\nImplemented or extensive training in machine learning methods (boosted regression trees, random forests, neural networks)\nSophisticated use of data analytics and visualization tools in reporting and influencing\nNice to have exposure in machine learning APIs and computational packages (Tensorflow, PyTorch, Rust, Caffe2, Gluon, Keras, similar framework).\nExperience with Tableau Server, Alteryx, and SAS is good to have but not mandatory\n,Other Details DepartmentSales / BDIndustry IT Banking / Financial Services EducationGraduation",
    "": ""
  },
  {
    "jobTitle": "jobTitle",
    "jobDescription": "jobDescription",
    "": ""
  },
  {
    "jobTitle": "Cyber Security - Analyst",
    "jobDescription": "Job Details*\nLooking for a cyber security analyst whose main objective is to help the execution of Cybersecurity programs. Main missions :\n\nProvide support on analysis of supplier contracts for third party risk management program.\nReview supplier certificates and evidences based on a checklist .\nCollaborate with other vendors for raising supplier assessments and evaluating supplier postures.\nOnboard different SE BUs onto Third Party program.\nPlay active role in third party incident resolution and Collaborate with other security teams on the same.\nActively participate in operationalizing the Supplier access process\n\n\n, *\n\n\n\nBachelors Degree in a related Cybersecurity/IT/Computer Science field\nQuick learner with the ability to learn and adapt quickly\nKnowledge of Windows, basic security, and networking principles\nKnowledge of cyber security attack vectors and threats\nKnowledge on Third Party Risk Management objectives\nExcellent written and spoken Communication skills\nSoft skills - Influencing skills \n\n\nOther Details DepartmentStatistics / AnalyticsIndustry IT Manufacturing EducationGraduation",
    "": ""
  },
  {
    "jobTitle": "Profile for Cyber Security Analyst",
    "jobDescription": "Job DetailsRole Purpose The purpose of this role is to analyse, identify, rectify &recommend specific improvement measures that help in the securityposture of the organization by protecting the sensitive information Do Ensuring customer centricity by providing aptcybersecurity Monitoring and safeguarding the log sources and security access Planning for disaster recovery in the event of any securitybreaches Monitor for attacks, intrusions and unusual, unauthorized orillegal activity Performs moderately complex log reviews and forensic analysis toidentify unauthorized or unacceptable access to data or systems Conduct security assessments, risk analysis and root causeanalysis of security incidents Handling incidents escalated by the L1 team in 24x7 rotationalshifts Use advanced analytics tools to determine emerging threatpatterns and vulnerabilities Completing all tactical security operations tasks associatedwith this engagement. Analyses all the attacks and come up with remedial attackanalysis Conduct detailed analysis of incidents and create reports anddashboards Stakeholder coordination & audit assistance Liaise with stakeholders in relation to cyber security issuesand provide future recommendations Maintain an information security risk register and assist withinternal and external audits relating to information security Assist with the creation, maintenance and delivery of cybersecurity awareness training for colleagues Advice and guidance to employees on issues such as spam andunwanted or malicious emails Stakeholder Interaction Stakeholder Type Stakeholder Identification Purpose of Interaction Internal Technical Lead/ Project Lead Regular reporting & updates Security Intelligence (Practice) Coordination for security reasons External Customer To coordinate for all security breaches & resolutions Display Lists the competencies required to perform this role effectively: Functional Competencies/ Skill Leveraging Technology - Knowledge of current and upcoming technology(automation, tools and systems) to build efficiencies and effectivenessin own function/ Client organization - Expert Process Excellence - Ability to follow the standards and norms toproduce consistent results, provide effective control and reduction ofrisk Expert Functional/Technical - Knowledge of Network Security devices,firewalls, end points, SIEM, application security, IPS/IDS, VA / PTskills - Master Competency Levels Foundation Knowledgeable about the competency requirements. Demonstrates (inparts) frequently with minimal support and guidance. Competent Consistently demonstrates the full range of the competencywithout guidance. Extends the competency to difficult and unknownsituations as well. Expert Applies the competency in all situations and is serves as a guideto others as well. Master Coaches others and builds organizational capability in thecompetency area. Serves as a key resource for that competency and isrecognized within the entire organization. Behavioral Competencies Effective Communication Collaborative Working Execution Excellence Problem Solving & Analytical Skills Deliver No. Performance Parameter Measure 1. Customer centricity Timely security breach solutioning to end users,Internal stakeholders & external customers experience 2. Process Adherence Adherence to SLA s (90-95%), response time and resolutiontime TAT,Other Details DepartmentGeneral / Other SoftwareSecurity ServicesIndustry IT IT - Software EducationGraduation",
    "": ""
  },
  {
    "jobTitle": "Looking applicants for-Cyber Security Analyst",
    "jobDescription": "Job DetailsRole Purpose The purpose of this role is to analyse, identify, rectify &recommend specific improvement measures that help in the securityposture of the organization by protecting the sensitive information Do Ensuring customer centricity by providing aptcybersecurity Monitoring and safeguarding the log sources and security access Planning for disaster recovery in the event of any securitybreaches Monitor for attacks, intrusions and unusual, unauthorized orillegal activity Performs moderately complex log reviews and forensic analysis toidentify unauthorized or unacceptable access to data or systems Conduct security assessments, risk analysis and root causeanalysis of security incidents Handling incidents escalated by the L1 team in 24x7 rotationalshifts Use advanced analytics tools to determine emerging threatpatterns and vulnerabilities Completing all tactical security operations tasks associatedwith this engagement. Analyses all the attacks and come up with remedial attackanalysis Conduct detailed analysis of incidents and create reports anddashboards Stakeholder coordination & audit assistance Liaise with stakeholders in relation to cyber security issuesand provide future recommendations Maintain an information security risk register and assist withinternal and external audits relating to information security Assist with the creation, maintenance and delivery of cybersecurity awareness training for colleagues Advice and guidance to employees on issues such as spam andunwanted or malicious emails Stakeholder Interaction Stakeholder Type Stakeholder Identification Purpose of Interaction Internal Technical Lead/ Project Lead Regular reporting & updates Security Intelligence (Practice) Coordination for security reasons External Customer To coordinate for all security breaches & resolutions Display Lists the competencies required to perform this role effectively: Functional Competencies/ Skill Leveraging Technology - Knowledge of current and upcoming technology(automation, tools and systems) to build efficiencies and effectivenessin own function/ Client organization - Expert Process Excellence - Ability to follow the standards and norms toproduce consistent results, provide effective control and reduction ofrisk Expert Functional/Technical - Knowledge of Network Security devices,firewalls, end points, SIEM, application security, IPS/IDS, VA / PTskills - Master Competency Levels Foundation Knowledgeable about the competency requirements. Demonstrates (inparts) frequently with minimal support and guidance. Competent Consistently demonstrates the full range of the competencywithout guidance. Extends the competency to difficult and unknownsituations as well. Expert Applies the competency in all situations and is serves as a guideto others as well. Master Coaches others and builds organizational capability in thecompetency area. Serves as a key resource for that competency and isrecognized within the entire organization. Behavioral Competencies Effective Communication Collaborative Working Execution Excellence Problem Solving & Analytical Skills Deliver No. Performance Parameter Measure 1. Customer centricity Timely security breach solutioning to end users,Internal stakeholders & external customers experience 2. Process Adherence Adherence to SLA s (90-95%), response time and resolutiontime TAT GRC Consulting,Other Details DepartmentGeneral / Other SoftwareSecurity ServicesIndustry IT IT - Software EducationGraduation",
    "": ""
  },
  {
    "jobTitle": "AVP Enterprise Security",
    "jobDescription": "Job DetailsHi,\nWe are looking for the position of AVP - Enterprise Security for one of our premium client.\n \n \nLocations: Chennai , Mumbai , Bangalore\n \n \nJob Description:\n \n \n\nBeing an Intrapreneur within an enterprise, supporting the practice head, in identifying business opportunities, positioning Enterprise IT.\nSecurity products, solutions & services, consulting to customers and setup best practices to deliver world-class services, including governance, Risk & Compliance Management, SIEM, Vulnerability Management, Identity / Access Management, and Enterprise wide Security Architecture.\nEstablishing a strong external ecosystem to draw maximum leverage via ISV / OEM Partnering.\nEngaging with analysts and advisors to drive market differentiation / leadership to create business value differentiations & unique value.\nPropositions among competing companies.\nEngage at a CIO, CISO, CTO level and advise them wearing a consulting hat.\nAny certifications like ITIL V3, CISSP, C|CISO, CCSK is an added advantage.\nGTM Strategy for this practice/business.\nResponsible for managing the BUs P&L.\nNurture & grow a strong practice team fostering a positive, high-energy & high-performance culture.\n\n \n \n \nIf anyone interested share your update CV to\nhidden_emailOther Details DepartmentNetworkingIndustry IT IT - Hardware / Networking",
    "": ""
  },
  {
    "jobTitle": "AVP - Enterprise Security  Leading MNC Company",
    "jobDescription": "Job DetailsWarm Greeting,\nCurrently We are Hiring for AVP - Enterprise Security # Leading MNC company\nLocation: Mumbai, Bangalore, Chennai\nExp: 14-20 years\n ROLES & RESPONSIBILITIES:\nA) Intrapreneur:\nBeing an Intrapreneur within an enterprise, supporting the practice head, in identifying business opportunities, positioning Enterprise IT Security products, solutions & services, consulting to customers and setup best practices to deliver world-class services, including Governance, Risk & Compliance Management, SIEM, Vulnerability Management, Identity / Access Management, and Enterprise wide Security Architecture.\nEstablishing a strong external ecosystem to draw maximum leverage via ISV / OEM Partnering. Engaging with analysts and advisors to drive market differentiation / leadership to create business value differentiations & unique value propositions among competing companies.\nEngage at a CIO, CISO, CTO level and advise them wearing a consulting hat.\nAny certifications like ITIL V3, CISSP, C|CISO, CCSK is an added advantage\nGTM Strategy for this practice/business.\nResponsible for managing the BUs P&L.\nNurture & grow a strong practice team fostering a positive, high-energy & high-performance culture.\nB) Technocrat:\nTechnology expert.\nBuild a team of solution architects & subject matter experts.\nAbility to establish a unique, clear & specific use cases for enterprise customers.\nCreate solution centers/POCs, showcasing company's core expertise in this practice.\nC) Business Management:\nStrategic & tactical vision and execution plan, for business growth.\nMarket intelligence.\nSupport effective project execution in tandem with delivery team(s).\nExcellence in business forecasting accuracy.\nStrategizing market positioning statements, of solutions/services offered.\n \nReagrds,\nSaranya Ramakrishnan\nRecruitment Consultant -  People First Consultants Pvt Ltd.,\nMail to: hidden_emailOther Details DepartmentApplication Programming / MaintenanceIndustry IT IT - Software",
    "": ""
  },
  {
    "jobTitle": "Recruit for the post of Cyber Security Analyst",
    "jobDescription": "Job DetailsRole Purpose The purpose of this role is to analyse, identify, rectify &recommend specific improvement measures that help in the securityposture of the organization by protecting the sensitive information Do Ensuring customer centricity by providing aptcybersecurity Monitoring and safeguarding the log sources and security access Planning for disaster recovery in the event of any securitybreaches Monitor for attacks, intrusions and unusual, unauthorized orillegal activity Performs moderately complex log reviews and forensic analysis toidentify unauthorized or unacceptable access to data or systems Conduct security assessments, risk analysis and root causeanalysis of security incidents Handling incidents escalated by the L1 team in 24x7 rotationalshifts Use advanced analytics tools to determine emerging threatpatterns and vulnerabilities Completing all tactical security operations tasks associatedwith this engagement. Analyses all the attacks and come up with remedial attackanalysis Conduct detailed analysis of incidents and create reports anddashboards Stakeholder coordination & audit assistance Liaise with stakeholders in relation to cyber security issuesand provide future recommendations Maintain an information security risk register and assist withinternal and external audits relating to information security Assist with the creation, maintenance and delivery of cybersecurity awareness training for colleagues Advice and guidance to employees on issues such as spam andunwanted or malicious emails Stakeholder Interaction Stakeholder Type Stakeholder Identification Purpose of Interaction Internal Technical Lead/ Project Lead Regular reporting & updates Security Intelligence (Practice) Coordination for security reasons External Customer To coordinate for all security breaches & resolutions Display Lists the competencies required to perform this role effectively: Functional Competencies/ Skill Leveraging Technology - Knowledge of current and upcoming technology(automation, tools and systems) to build efficiencies and effectivenessin own function/ Client organization - Expert Process Excellence - Ability to follow the standards and norms toproduce consistent results, provide effective control and reduction ofrisk Expert Functional/Technical - Knowledge of Network Security devices,firewalls, end points, SIEM, application security, IPS/IDS, VA / PTskills - Master Competency Levels Foundation Knowledgeable about the competency requirements. Demonstrates (inparts) frequently with minimal support and guidance. Competent Consistently demonstrates the full range of the competencywithout guidance. Extends the competency to difficult and unknownsituations as well. Expert Applies the competency in all situations and is serves as a guideto others as well. Master Coaches others and builds organizational capability in thecompetency area. Serves as a key resource for that competency and isrecognized within the entire organization. Behavioral Competencies Effective Communication Collaborative Working Execution Excellence Problem Solving & Analytical Skills Deliver No. Performance Parameter Measure 1. Customer centricity Timely security breach solutioning to end users,Internal stakeholders & external customers experience 2. Process Adherence Adherence to SLA s (90-95%), response time and resolutiontime TAT Checkpoint Firewalls and VPN,Other Details DepartmentGeneral / Other SoftwareSecurity ServicesIndustry IT IT - Software EducationGraduation",
    "": ""
  },
  {
    "jobTitle": "Cyber Security Analyst",
    "jobDescription": "Job DetailsRole Purpose The purpose of this role is to analyse, identify, rectify &recommend specific improvement measures that help in the securityposture of the organization by protecting the sensitive information Do Ensuring customer centricity by providing aptcybersecurity Monitoring and safeguarding the log sources and security access Planning for disaster recovery in the event of any securitybreaches Monitor for attacks, intrusions and unusual, unauthorized orillegal activity Performs moderately complex log reviews and forensic analysis toidentify unauthorized or unacceptable access to data or systems Conduct security assessments, risk analysis and root causeanalysis of security incidents Handling incidents escalated by the L1 team in 24x7 rotationalshifts Use advanced analytics tools to determine emerging threatpatterns and vulnerabilities Completing all tactical security operations tasks associatedwith this engagement. Analyses all the attacks and come up with remedial attackanalysis Conduct detailed analysis of incidents and create reports anddashboards Stakeholder coordination & audit assistance Liaise with stakeholders in relation to cyber security issuesand provide future recommendations Maintain an information security risk register and assist withinternal and external audits relating to information security Assist with the creation, maintenance and delivery of cybersecurity awareness training for colleagues Advice and guidance to employees on issues such as spam andunwanted or malicious emails Stakeholder Interaction Stakeholder Type Stakeholder Identification Purpose of Interaction Internal Technical Lead/ Project Lead Regular reporting & updates Security Intelligence (Practice) Coordination for security reasons External Customer To coordinate for all security breaches & resolutions Display Lists the competencies required to perform this role effectively: Functional Competencies/ Skill Leveraging Technology - Knowledge of current and upcoming technology(automation, tools and systems) to build efficiencies and effectivenessin own function/ Client organization - Expert Process Excellence - Ability to follow the standards and norms toproduce consistent results, provide effective control and reduction ofrisk Expert Functional/Technical - Knowledge of Network Security devices,firewalls, end points, SIEM, application security, IPS/IDS, VA / PTskills - Master Competency Levels Foundation Knowledgeable about the competency requirements. Demonstrates (inparts) frequently with minimal support and guidance. Competent Consistently demonstrates the full range of the competencywithout guidance. Extends the competency to difficult and unknownsituations as well. Expert Applies the competency in all situations and is serves as a guideto others as well. Master Coaches others and builds organizational capability in thecompetency area. Serves as a key resource for that competency and isrecognized within the entire organization. Behavioral Competencies Effective Communication Collaborative Working Execution Excellence Problem Solving & Analytical Skills Deliver No. Performance Parameter Measure 1. Customer centricity Timely security breach solutioning to end users,Internal stakeholders & external customers experience 2. Process Adherence Adherence to SLA s (90-95%), response time and resolutiontime TAT Saviynt,Other Details DepartmentGeneral / Other SoftwareSecurity ServicesIndustry IT IT - Software EducationGraduation",
    "": ""
  },
  {
    "jobTitle": "Apply for-Cyber Security Analyst",
    "jobDescription": "Job DetailsRole Purpose The purpose of this role is to analyse, identify, rectify &recommend specific improvement measures that help in the securityposture of the organization by protecting the sensitive information Do Ensuring customer centricity by providing aptcybersecurity Monitoring and safeguarding the log sources and security access Planning for disaster recovery in the event of any securitybreaches Monitor for attacks, intrusions and unusual, unauthorized orillegal activity Performs moderately complex log reviews and forensic analysis toidentify unauthorized or unacceptable access to data or systems Conduct security assessments, risk analysis and root causeanalysis of security incidents Handling incidents escalated by the L1 team in 24x7 rotationalshifts Use advanced analytics tools to determine emerging threatpatterns and vulnerabilities Completing all tactical security operations tasks associatedwith this engagement. Analyses all the attacks and come up with remedial attackanalysis Conduct detailed analysis of incidents and create reports anddashboards Stakeholder coordination & audit assistance Liaise with stakeholders in relation to cyber security issuesand provide future recommendations Maintain an information security risk register and assist withinternal and external audits relating to information security Assist with the creation, maintenance and delivery of cybersecurity awareness training for colleagues Advice and guidance to employees on issues such as spam andunwanted or malicious emails Stakeholder Interaction Stakeholder Type Stakeholder Identification Purpose of Interaction Internal Technical Lead/ Project Lead Regular reporting & updates Security Intelligence (Practice) Coordination for security reasons External Customer To coordinate for all security breaches & resolutions Display Lists the competencies required to perform this role effectively: Functional Competencies/ Skill Leveraging Technology - Knowledge of current and upcoming technology(automation, tools and systems) to build efficiencies and effectivenessin own function/ Client organization - Expert Process Excellence - Ability to follow the standards and norms toproduce consistent results, provide effective control and reduction ofrisk Expert Functional/Technical - Knowledge of Network Security devices,firewalls, end points, SIEM, application security, IPS/IDS, VA / PTskills - Master Competency Levels Foundation Knowledgeable about the competency requirements. Demonstrates (inparts) frequently with minimal support and guidance. Competent Consistently demonstrates the full range of the competencywithout guidance. Extends the competency to difficult and unknownsituations as well. Expert Applies the competency in all situations and is serves as a guideto others as well. Master Coaches others and builds organizational capability in thecompetency area. Serves as a key resource for that competency and isrecognized within the entire organization. Behavioral Competencies Effective Communication Collaborative Working Execution Excellence Problem Solving & Analytical Skills Deliver No. Performance Parameter Measure 1. Customer centricity Timely security breach solutioning to end users,Internal stakeholders & external customers experience 2. Process Adherence Adherence to SLA s (90-95%), response time and resolutiontime TAT Vulnerability Assessment Penetrationtest,Other Details DepartmentGeneral / Other SoftwareSecurity ServicesIndustry IT IT - Software EducationGraduation",
    "": ""
  },
  {
    "jobTitle": "Cyber Security Analyst",
    "jobDescription": "Job DetailsRole Purpose The purpose of this role is to analyse, identify, rectify &recommend specific improvement measures that help in the securityposture of the organization by protecting the sensitive information Do Ensuring customer centricity by providing aptcybersecurity Monitoring and safeguarding the log sources and security access Planning for disaster recovery in the event of any securitybreaches Monitor for attacks, intrusions and unusual, unauthorized orillegal activity Performs moderately complex log reviews and forensic analysis toidentify unauthorized or unacceptable access to data or systems Conduct security assessments, risk analysis and root causeanalysis of security incidents Handling incidents escalated by the L1 team in 24x7 rotationalshifts Use advanced analytics tools to determine emerging threatpatterns and vulnerabilities Completing all tactical security operations tasks associatedwith this engagement. Analyses all the attacks and come up with remedial attackanalysis Conduct detailed analysis of incidents and create reports anddashboards Stakeholder coordination & audit assistance Liaise with stakeholders in relation to cyber security issuesand provide future recommendations Maintain an information security risk register and assist withinternal and external audits relating to information security Assist with the creation, maintenance and delivery of cybersecurity awareness training for colleagues Advice and guidance to employees on issues such as spam andunwanted or malicious emails Stakeholder Interaction Stakeholder Type Stakeholder Identification Purpose of Interaction Internal Technical Lead/ Project Lead Regular reporting & updates Security Intelligence (Practice) Coordination for security reasons External Customer To coordinate for all security breaches & resolutions Display Lists the competencies required to perform this role effectively: Functional Competencies/ Skill Leveraging Technology - Knowledge of current and upcoming technology(automation, tools and systems) to build efficiencies and effectivenessin own function/ Client organization - Expert Process Excellence - Ability to follow the standards and norms toproduce consistent results, provide effective control and reduction ofrisk Expert Functional/Technical - Knowledge of Network Security devices,firewalls, end points, SIEM, application security, IPS/IDS, VA / PTskills - Master Competency Levels Foundation Knowledgeable about the competency requirements. Demonstrates (inparts) frequently with minimal support and guidance. Competent Consistently demonstrates the full range of the competencywithout guidance. Extends the competency to difficult and unknownsituations as well. Expert Applies the competency in all situations and is serves as a guideto others as well. Master Coaches others and builds organizational capability in thecompetency area. Serves as a key resource for that competency and isrecognized within the entire organization. Behavioral Competencies Effective Communication Collaborative Working Execution Excellence Problem Solving & Analytical Skills Deliver No. Performance Parameter Measure 1. Customer centricity Timely security breach solutioning to end users,Internal stakeholders & external customers experience 2. Process Adherence Adherence to SLA s (90-95%), response time and resolutiontime TAT GRC Technology,Other Details DepartmentGeneral / Other SoftwareIndustry IT IT - Software EducationGraduation",
    "": ""
  },
  {
    "jobTitle": "EPH4_Cyber Security Expert_Bangalore",
    "jobDescription": "Job DetailsJob Description\nSeeking a Cybersecurity Expert for Driver Assistance Electronic control Unit Based on RADAR, Front Video, Ultrasonic sensor and Near range Cameras. The cyber security Expert will design security solutions and support system engineers to develop secure connectivity solutions.\n\nResponsible for developing cutting edge Automotive cybersecurity solution such as Trusted boot, Secure communication ,Secure logging, Secure coding, Ethernet Security (e.g. SecOC , TLS), SOTA/FOTA - Software/Firmware Over the Air, Fuzz testing.\nDiscuss and review all customer security requirements and propose solutions and ensure that Bosch product satisfies all security requirements\nApplication and Configuration of Hardware Trust Anchors and CryptoStack/libraries\nDevelop the Security architecture (system and Software level) along with project architects, Develop Security Concept, identify the gap between Customer Security Requirements & Security platform and perform TARA to identify the remaining residual risk in customer project.\nTo Identify, plan, establish, coordinate and monitor the security activities identified in the process throughout the product development life cycle.\nProvide technical support to development team, collaborate on incident response and customer complaints related to security issues.\nBeyond the scope of product engineering, consider the impacts on production and In-Field Use Cases, e.g : return analysis.\n,Other Details DepartmentGeneral / Other SoftwareIndustry IT Manufacturing EducationGraduation",
    "": ""
  }
]